title: Win Login Succeeded2
id: pktlog-0000-0001
status: experimental
description: This is some description here
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.001/T1069.001.md
author: frack113
date: 2021/12/12
modified: 2023/02/14
tags:
    - TA0007
logsource: pktlog
detection:
    selection1:
        EventID: 4624
        LogonType: 3
        LogonProcessName: "Kerberos"
    filter1:
        IpAddress:
            - "::1"
            - "fe80"
            - "127.0.0.1"
    filter2:
        TargetUserSid|contains:
            - "S-1-5-18"
            - "S-1-5-90-0-"
    filter3:
        TargetUserName|endswith: "$"
    condition: selection1 and not filter1 and not filter2 and not filter3
rdx_key: rule_cache:aduser_info # ada:engine:rule_cache:aduser_info ## must unique by manually!!!!
fields:
    - "Hostname"
    - "TargetDomainName"
    - "TargetUserName"
    - "TargetUserSid"
    - "IpAddress"
unique_fields:
    - "Hostname"
    - "TargetUserName"
level: info
