title: A directory service object(GPO) was created.
id: winlog-0103-0007
status: test
description: Detects usage of windows powershell executed
references:
  - https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
author: Michael
date: 2017/03/09
modified: 2023/02/15
tags:
  - TA0004
logsource:
  product: windows
  category: process_creation
detection:
  selection_source:
    Channel: "Security"
    EventID: 5137
  condition: selection_source
fields:
  - 'Hostname'
  - 'DSName'
  - 'SubjectUserName'
  - 'SubjectUserSid'
  - 'ObjectClass'
  - 'ObjectDN'
unique_fields:
  - 'DSName'
  - 'SubjectUserName'
level: medium