title: Attempt reset AD account's password
id: winlog-0103-0002
status: test
description: Detects usage of windows powershell executed
references:
  - https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
author: Michael
date: 2017/03/09
modified: 2023/02/15
tags:
  - TA0006
logsource:
  product: windows
  category: process_creation
detection:
  selection_source:
    Channel: "Security"
    EventID: 4724
  filter_ignore:
    ScriptBlockText|contains:
      - 'prompt'
  condition: selection_source
fields:
  - 'Hostname'
  - 'SubjectUserName'
  - 'SubjectUserSid'
  - 'TargetSid'
  - 'TargetUserName'
  - 'EventType'
unique_fields:
  - 'Hostname'
  - 'SubjectUserName'
  - 'TargetUserName'
level: medium