title: Account Password Reset Attempt
id: winlog-0008
status: test
rule_origin: internal
description: Detects an attempt to reset another account password (Event ID 4724). On domain controllers, this is an important
  account-management signal for privileged account monitoring and possible account manipulation.
references:
- https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4724
- https://attack.mitre.org/techniques/T1098/
author: ADA default rules
date: 2017/03/09
modified: 2026/05/05
tags:
- TA0003
- TA0004
- attack.t1098
- attack.persistence
- attack.privilege_escalation
logsource: winlog
detection:
  selection_source:
    Channel: Security
    EventID: 4724
  filter_ignore:
    ScriptBlockText|contains:
    - prompt
  condition: selection_source
fields:
- Hostname
- SubjectUserName
- SubjectUserSid
- TargetSid
- TargetUserName
- EventType
unique_fields:
- Hostname
- SubjectUserName
- TargetUserName
level: medium
x_legacy_id: winlog-0103-0002
x_legacy_file: engine/rules/winlog/0103-0002-user_passwd_update.yml
