title: Group Policy Object Modified Or Moved
id: winlog-0014
status: test
rule_origin: internal
description: Detects Active Directory object modification or move events (5136, 5139) used to monitor Group Policy Object
  changes on domain controllers. GPO changes can alter security controls or execute code across many hosts.
references:
- https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-5136
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/audit-directory-service-changes
- https://attack.mitre.org/techniques/T1484/001/
author: ADA default rules
date: 2017/03/09
modified: 2026/05/05
tags:
- TA0004
- TA0005
- attack.t1484.001
- attack.privilege_escalation
- attack.defense_evasion
logsource: winlog
detection:
  selection_source:
    Channel: Security
    EventID:
    - 5136
    - 5139
  condition: selection_source
fields:
- Hostname
- DSName
- SubjectUserName
- SubjectUserSid
- ObjectClass
- ObjectDN
unique_fields:
- DSName
- SubjectUserName
level: medium
x_legacy_id: winlog-0103-0008
x_legacy_file: engine/rules/winlog/0103-0008-ad_gpo_policy_updated.yml
