title: Suspicious Active Directory DPAPI attributes accessed (Mimikatz, DCSync, RiskySPN)
id: winlog-0025
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to extract sensitive DPAPI information from Active Directory (RiskySPN
  PowerShell tool, DCSync and Mimikatz may also trigger this rule).
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1555-Credentials%20from%20Password%20Stores
- https://docs.microsoft.com/en-us/windows/win32/adschema/extended-rights
- https://github.com/PSGumshoe/PSGumshoe/blob/master/DirectoryService/PrivateFunctions.ps1
- https://stealthbits.com/blog/detecting-persistence-through-active-directory-extended-rights/
- https://cqureacademy.com/blog/extracting-roamed-private-keys
- https://www.harmj0y.net/blog/redteaming/operational-guidance-for-offensive-user-dpapi-abuse/
- https://www.mandiant.com/resources/blog/apt29-windows-credential-roaming
- https://www.dsinternals.com/en/retrieving-dpapi-backup-keys-from-active-directory/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1555.004
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4662
    Properties|contains:
    - 612cb747-c0e8-4f92-9221-fdd5f15b550d
    - 6617e4ac-a2f1-43ab-b60c-11fbd1facf05
    - b3f93023-9239-4f7c-b99c-6745d87adbc2
    - b7ff5a38-0818-42b0-8110-d3d154c97f24
    - b8dfa744-31dc-4ef1-ac7c-84baf7ef9da7
  filter:
    SubjectUserName|endswith: $
  condition: selection and not filter
fields:
- Hostname
- EventID
- Properties
- SubjectUserName
- ObjectName
unique_fields:
- Hostname
falsepositives:
- Active Directory Backup solutions
level: info
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-DPAPI attribute accessed (DCSync, Mimikatz, RiskySPN).yaml
x_legacy_id: winlog-9000-0001
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0001-suspicious_active_directory_dpapi_attributes_accessed_mimikatz_dcsync_ri.yml
