title: DSRM password changed (Reg via PowerShell)
id: winlog-0026
status: experimental
rule_origin: public
description: Detects scenarios where an attacker reset or synchronize with another domain account the DSRM (Directory Services
  Restore Mode) password in order to escalate privileges.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
- https://adsecurity.org/?p=1714
- https://adsecurity.org/?p=1785
- https://book.hacktricks.xyz/windows/active-directory-methodology/dsrm-credentials
- https://www.hackingarticles.in/domain-persistence-dsrm/
- https://azurecloudai.blog/2020/06/19/how-to-reset-the-directory-service-restore-mode-dsrm-password/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1098
- attack.persistence
logsource:
  product: windows
  category:
  - ps_module
  - ps_script
detection:
  selection_powershell_modern:
    EventID: 4103
    Payload|contains|all:
    - -ItemProperty
    - \SYSTEM\CurrentControlSet\Control\Lsa
    - DsrmAdminLogonBehavior
  selection_powershell_block:
    EventID: 4104
    ScriptBlockText|contains|all:
    - -ItemProperty
    - \SYSTEM\CurrentControlSet\Control\Lsa
    - DsrmAdminLogonBehavior
  condition: 1 of selection*
fields:
- Hostname
- EventID
- Payload
- ScriptBlockText
unique_fields:
- Hostname
falsepositives:
- Disaster recovery situation
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-DSRM configuration changed (Reg via PowerShell).yaml
x_legacy_id: winlog-9000-0002
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0002-dsrm_password_changed_reg_via_powershell.yml
