title: DSRM password changed (Reg via command)
id: winlog-0027
status: experimental
rule_origin: public
description: Detects scenarios where an attacker reset or synchronize with another domain account the DSRM (Directory Services
  Restore Mode) password in order to escalate privileges.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
- https://adsecurity.org/?p=1714
- https://adsecurity.org/?p=1785
- https://book.hacktricks.xyz/windows/active-directory-methodology/dsrm-credentials
- https://www.hackingarticles.in/domain-persistence-dsrm/
- https://azurecloudai.blog/2020/06/19/how-to-reset-the-directory-service-restore-mode-dsrm-password/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1098
- attack.persistence
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith: \reg.exe
    CommandLine|contains|all:
    - REG ADD
    - \SYSTEM\CurrentControlSet\Control\Lsa
    - DsrmAdminLogonBehavior
  condition: selection
fields:
- Hostname
- CommandLine
- EventID
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- Disaster recovery situation
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-DSRM configuration changed (Reg via command).yaml
x_legacy_id: winlog-9000-0003
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0003-dsrm_password_changed_reg_via_command.yml
