title: Suspicious modification of a sensitive Group Policy (GPO)
id: winlog-0030
status: experimental
rule_origin: public
description: Detects scenarios where an attacker will attempt to take control over a group policy.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0004-Privilege%20Escalation/T1484.001-Domain%20Policy%20Modification-Group%20Policy%20Modification
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0004
- attack.t1484.001
- attack.privilege_escalation
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5136
    AttributeLDAPDisplayName: versionNumber
    ObjectClass: groupPolicyContainer
    OperationType: '%%14674'
    ObjectGUID|contains:
    - xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
    - xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
    - xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
    - xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
  filter:
    AttributeValue: '0'
  condition: selection and not filter
fields:
- Hostname
- AttributeLDAPDisplayName
- AttributeValue
- EventID
- ObjectClass
- ObjectGUID
- OperationType
unique_fields:
- Hostname
falsepositives:
- Group policy administrator activity / AGPM activity
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-GPO sensitive modified.yaml
x_legacy_id: winlog-9000-0006
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0006-suspicious_modification_of_a_sensitive_group_policy_gpo.yml
