title: IFM detected - ESENT (installation from media)
id: winlog-0034
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to create an IFM image (usually used for deploying domain controllers
  to reduce replication traffic) for dumping credentials.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
- https://adsecurity.org/?p=2398
- https://www.ired.team/offensive-security/credential-access-and-credential-dumping/ntds.dit-enumeration
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0000
- attack.t1003.003
- attack.credential_dumping
logsource:
  product: windows
  service: application
detection:
  selection:
    EventID:
    - 325
    - 326
    - 327
    EventData|contains:
    - \ntds.dit
  filter:
  - <normal backup path>
  condition: selection and not filter
fields:
- Hostname
- EventData
- EventID
- filter
unique_fields:
- Hostname
falsepositives:
- Administrator creating a IFM image
- Backup program or script
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-IFM created (native).yaml
x_legacy_id: winlog-9000-0010
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0010-ifm_detected_esent_installation_from_media.yml
