title: Brutforce enumeration with unexisting users (Kerberos)
id: winlog-0035
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to enumerate potential existing users, resulting in failed Kerberos
  TGT requests with unexisting or invalid accounts.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1110.xxx-Brut%20force
- https://github.com/ropnop/kerbrute
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1110
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
    - 4771
    - 4768
    Status: '0x6'
  filter:
  - IpAddress: '%domain_controllers_ips%'
  - TicketOptions: 1350565888
  condition: selection and not filter
fields:
- Hostname
- EventID
- IpAddress
- Status
- TicketOptions
- TargetUserName
unique_fields:
- Hostname
falsepositives:
- Missconfigured application or identity services
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-Kerberos  brutforce enumeration with unexisting users.yaml
x_legacy_id: winlog-9000-0011
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0011-brutforce_enumeration_with_unexisting_users_kerberos.yml
