title: Kerberos AS-REP Roasting ticket request detected
id: winlog-0036
status: experimental
rule_origin: public
description: Detects scenarios where an attacker abuse an account with UAC settings set to "Accounts Does not Require Pre-Authentication"
  in order to perform offline TGT brutforce. May also be triggered by an attacker performing some Kerberos user enumration
  with tools like "Kerbrute".
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1558-Steal%20or%20Forge%20Kerberos%20Tickets
- https://github.com/HarmJ0y/ASREPRoast
- https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/as-rep-roasting-using-rubeus-and-hashcat
- https://m0chan.github.io/2019/07/31/How-To-Attack-Kerberos-101.html#as-rep-roasting
- https://medium.com/@jsecurity101/ioc-differences-between-kerberoasting-and-as-rep-roasting-4ae179cdf9ec
- https://rioasmara.com/2020/07/04/kerberoasting-as-req-pre-auth-vs-non-pre-auth/
- https://www.hackingarticles.in/as-rep-roasting/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1558.004
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4768
    Status|contains: '0x0'
    ServiceSid|endswith: '-502'
    PreAuthType|contains: '0'
  filter:
  - IpAddress: '%domain_controllers_ips%'
  condition: selection and not filter
fields:
- Hostname
- EventID
- IpAddress
- PreAuthType
- ServiceSid
- Status
unique_fields:
- Hostname
falsepositives:
- Account configured to not require pre-authentication
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-Kerberos AS-REP Roasting.yaml
x_legacy_id: winlog-9000-0012
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0012-kerberos_as_rep_roasting_ticket_request_detected.yml
