title: Kerberos enumeration with existing/unexisting users (Kerbrute)
id: winlog-0040
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to enumerate existing or non existing users using "Kerbrute". This
  use case can also be related to spot vulnearbility "MS14-068".
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1110.xxx-Brut%20force
- https://github.com/ropnop/kerbrute
- https://www.jpcert.or.jp/english/pub/sr/20170612ac-ir_research_en.pdf
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1110
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
    - 4771
    - 4768
    Status: '0x6'
    TicketOptions: 1350565888
  filter:
  - IpAddress: '%domain_controllers_ips%'
  - TargetUserName: '%account_allowed_proxy%'
  condition: selection and not filter
fields:
- Hostname
- EventID
- IpAddress
- Status
- TargetUserName
- TicketOptions
unique_fields:
- Hostname
falsepositives:
- Missconfigured application or identity services
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-Kerberos enumeration with existing-unexsting users (Kerbrute).yaml
x_legacy_id: winlog-9000-0016
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0016-kerberos_enumeration_with_existing_unexisting_users_kerbrute.yml
