title: Kerberos key list attack for credential dumping
id: winlog-0041
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to forge a special Kerberos service ticket in order to extract credentials
  from Read Only Domain Controllers (RODC).
references:
- https://www.secureauth.com/blog/the-kerberos-key-list-attack-the-return-of-the-read-only-domain-controllers/
- https://www.tarlogic.com/blog/how-to-attack-kerberos/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1003
- attack.t1558
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4769
    Status|contains: '0x0'
    TicketOptions: '0x10000'
  filter:
  - IpAddress: '%domain_controllers_ips%'
  - TargetUserName: '%account_allowed_proxy%'
  condition: selection and not filter
fields:
- Hostname
- EventID
- IpAddress
- Status
- TargetUserName
- TicketOptions
unique_fields:
- Hostname
falsepositives:
- Applications or services performing delegation activities, ADFS servers
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-Kerberos key list attack.yaml
x_legacy_id: winlog-9000-0017
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0017-kerberos_key_list_attack_for_credential_dumping.yml
