title: Suspicious Kerberos password account reset to issue potential Golden ticket
id: winlog-0042
status: experimental
rule_origin: public
description: Detects scenarios where a suspicious password reset of the Krbtgt account is performed by attacker to issue a
  potential Golden ticket.
references:
- https://cert.europa.eu/static/WhitePapers/CERT-EU-SWP_14_07_PassTheGolden_Ticket_v1_1.pdf
- https://adsecurity.org/?p=483
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1558.001
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4724
    TargetSid|endswith: '-502'
  condition: selection
fields:
- Hostname
- EventID
- TargetSid
unique_fields:
- Hostname
falsepositives:
- Administrators following best practices and reseting the Krbtgt password 1 or 2 times a year
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-Kerberos krbtgt password reset (Golden ticket).yaml
x_legacy_id: winlog-9000-0018
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0018-suspicious_kerberos_password_account_reset_to_issue_potential_golden_tic.yml
