title: Kerberos TGS ticket request related to a potential Golden ticket
id: winlog-0044
status: experimental
rule_origin: public
description: Detects scenarios where an attacker request a potential Golden ticket. Findings returned by this rule may not
  confirm at 100% that a Golden ticket was generated and further investigations would be required to confirm it. Another indicator
  (in case of a lazy Golden ticket) to check would be to check if the TargetUserName refers to an existing user in the domain.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1558-Steal%20or%20Forge%20Kerberos%20Tickets
- https://infosecwriteups.com/forest-an-asreproast-dcsync-and-golden-ticket-hackthebox-walkthrough-ade8dcdd1ee5
- https://attack.stealthbits.com/how-golden-ticket-attack-works
- https://www.hackingarticles.in/domain-persistence-golden-ticket-attack/
- https://adsecurity.org/?p=1515
- https://en.it-pirate.eu/azure-atp-golden-ticket-attack-how-golden-ticket-attacks-work/
- https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/kerberos-golden-tickets
- https://bond-o.medium.com/golden-ticket-attack-ea89553cf9c0
- https://www.blackhat.com/docs/us-15/materials/us-15-Metcalf-Red-Vs-Blue-Modern-Active-Directory-Attacks-Detection-And-Protection-wp.pdf
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1558.001
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4768
    TargetDomainName|re: <domain_in_lowercase.xxx>
    TicketOptions:
    - 1082195968
    - 1619066896
    TicketEncryptionType: 18
    Status|contains: '0x0'
  filter:
    IpAddress:
    - ::1
    - 127.0.0.1
    - '%domain_controllers_ips%'
  condition: selection and not filter
fields:
- Hostname
- EventID
- IpAddress
- Status
- TargetDomainName
- TicketEncryptionType
- TicketOptions
unique_fields:
- Hostname
falsepositives:
- Unknown
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-Kerberos ticket related to a potential Golden ticket.yaml
x_legacy_id: winlog-9000-0020
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0020-kerberos_tgs_ticket_request_related_to_a_potential_golden_ticket.yml
