title: Potential SAM database user credentials dumped with DCshadow
id: winlog-0050
status: experimental
rule_origin: public
description: Detects scenarios where an attacker would dump user passwords using the DCshadow attack.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
- https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/t1207-creating-rogue-domain-controllers-with-dcshadow
- https://medium.com/@maarten.goet/dcshadow-detecting-a-rogue-domain-controller-replicating-malicious-changes-to-your-active-1e22440df9ad
- https://github.com/AlsidOfficial/UncoverDCShadow
- https://github.com/shellster/DCSYNCMonitor
- https://blog.alsid.eu/dcshadow-explained-4510f52fc19d
- https://stealthbits.com/blog/detecting-dcshadow-with-event-logs/
- https://www.labofapenetrationtester.com/2018/05/dcshadow-sacl.html
- https://blog.stealthbits.com/creating-persistence-with-dcshadow/
- https://book.hacktricks.xyz/windows/active-directory-methodology/dcshadow
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1003.001
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4661
    SubjectUserSid: S-1-5-18
    ProcessName|endswith: \lsass.exe
    ObjectServer: Security Account Manager
    ObjectType:
    - SAM_SERVER
    - SAM_DOMAIN
    ObjectName|startswith:
    - CN=
    - DC=
    AccessList|contains|all:
    - '%%5392'
    - '%%5447'
  condition: selection
fields:
- Hostname
- AccessList
- EventID
- ObjectName
- ObjectServer
- ObjectType
- ProcessName
- SubjectUserSid
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-SAM database access during DCshadow.yaml
x_legacy_id: winlog-9000-0026
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0026-potential_sam_database_user_credentials_dumped_with_dcshadow.yml
