title: SAM database user credentials dump with Mimikatz
id: winlog-0051
status: experimental
rule_origin: public
description: Detects scenarios where an attacker dump the LSASS memory content using Mimikatz (sekurlsa module).
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
- https://ivanitlearning.wordpress.com/2019/09/07/mimikatz-and-password-dumps/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1003.001
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4661
    ProcessName|endswith: \lsass.exe
    ObjectServer: Security Account Manager
    ObjectType: SAM_USER
    ObjectName|startswith: S-1-5-21-
    AccessList|contains|all:
    - '%%5446'
    - '%%5447'
  filter:
    SubjectUserName|endswith: $
  condition: selection and not filter
fields:
- Hostname
- AccessList
- EventID
- ObjectName
- ObjectServer
- ObjectType
- ProcessName
- SubjectUserName
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-SAM database user credentials dump with Mimikatz.yaml
x_legacy_id: winlog-9000-0027
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0027-sam_database_user_credentials_dump_with_mimikatz.yml
