title: Bruteforce via password reset
id: winlog-0056
status: experimental
rule_origin: public
description: Detects if a attacker attempts to reset multiple times a user password to perform a bruteforce attack.
references:
- https://twitter.com/mthcht/status/1705164058343756005?s=08
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1110.001
- attack.t1110.003
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
    - 4723
    - 4724
  condition: selection
fields:
- Hostname
- EventID
- TargetSid
- host
unique_fields:
- TargetSid
falsepositives:
- ADFS, DirSync
level: info
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-bruteforce via password reset.yaml
x_legacy_id: winlog-9000-0032
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0032-bruteforce_via_password_reset.yml
