title: Computer account created with privileges
id: winlog-0058
status: experimental
rule_origin: public
description: Detects scenarios where an attacker creates a computer account with privileges for later exploitation.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1136-Create%20account
- https://exploit.ph/cve-2021-42287-cve-2021-42278-weaponisation.html
- https://www.thehacker.recipes/ad/movement/kerberos/samaccountname-spoofing
- https://support.microsoft.com/en-us/topic/kb5008380-authentication-updates-cve-2021-42287-9dafac11-e0d0-4cb8-959a-143bd0201041
- https://github.com/WazeHell/sam-the-admin
- https://github.com/cube0x0/noPac
- https://github.com/ly4k/Pachine
- https://cloudbrothers.info/en/exploit-kerberos-samaccountname-spoofing/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1098
- attack.t1136
- attack.t1068
- attack.persistence
- attack.privilege_escalation
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4741
  filter:
    PrivilegeList: '-'
  condition: selection and not filter
fields:
- Hostname
- EventID
- PrivilegeList
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-computer account created with privileges.yaml
x_legacy_id: winlog-9000-0034
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0034-computer_account_created_with_privileges.yml
