title: Computer account manipulation for delegation (RBCD)
id: winlog-0061
status: experimental
rule_origin: public
description: Detects scenarios where an attacker manipulate a computer object and updates its attribute 'msDS-AllowedToActOnBehalfOfOtherIdentity'
  to enable a resource to impersonate and authenticate any domain user.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
- https://www.microsoft.com/en-us/security/blog/2022/05/25/detecting-and-preventing-privilege-escalation-attacks-leveraging-kerberos-relaying-krbrelayup/
- https://book.hacktricks.xyz/windows-hardening/active-directory-methodology/resource-based-constrained-delegation
- https://pentestlab.blog/2021/10/18/resource-based-constrained-delegation/
- https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/resource-based-constrained-delegation-ad-computer-object-take-over-and-privilged-code-execution
- https://blog.netwrix.com/2022/09/29/resource-based-constrained-delegation-abuse/
- https://www.fortalicesolutions.com/posts/hunting-resource-based-constrained-delegation-in-active-directory
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1098
- attack.persistence
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5136
    DSType: '%%14676'
    ObjectClass: computer
    AttributeLDAPDisplayName: msDS-AllowedToActOnBehalfOfOtherIdentity
  condition: selection
fields:
- Hostname
- AttributeLDAPDisplayName
- DSType
- EventID
- ObjectClass
unique_fields:
- Hostname
falsepositives:
- Computer account set for delegation by a sysadmin
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-computer account set for RBCD delegation.yaml
x_legacy_id: winlog-9000-0037
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0037-computer_account_manipulation_for_delegation_rbcd.yml
