title: Extended rights backdoor obfuscation (via localizationDisplayId attribute)
id: winlog-0065
status: experimental
rule_origin: public
description: Detects scenarios where an attacker modifies the "configuration" partition in order to obfuscate sneaky changes
  that will allow him to introduce a stealthy AdminSDholder backdoor.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1546-Event%20Triggered%20Execution
- https://adds-security.blogspot.com/2017/08/adminsdholder-backdoor-via-substitution.html
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0005
- attack.t1564
- attack.defense_evasion
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5136
    OperationType: '%%14674'
    AttributeLDAPDisplayName: localizationDisplayId
    ObjectDN|contains: CN=Extended-Rights,CN=Configuration
  filter:
    SubjectUserName|endswith: $
  condition: selection and not filter
fields:
- Hostname
- AttributeLDAPDisplayName
- EventID
- ObjectDN
- OperationType
- SubjectUserName
unique_fields:
- Hostname
falsepositives:
- Unknown
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-extended rights backdoor obfuscation (via localizationDisplayId attr.).yaml
x_legacy_id: winlog-9000-0041
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0041-extended_rights_backdoor_obfuscation_via_localizationdisplayid_attribute.yml
