title: Group Managed Service Accounts password dump - GoldenGMSA
id: winlog-0066
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to dump Group Managed Services account (GMSA) passwords stored on
  writable domain controllers.
references:
- https://www.semperis.com/blog/golden-gmsa-attack/
- https://twitter.com/cnotin/status/1498952017263353858?t=PX9bWqa2SZLOZnpXbOScUg&s=09
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1003
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4662
    ObjectServer: DS
    ObjectType: msKds-ProvRootKey
  filter:
    SubjectUserSid: S-1-5-18
  condition: selection and not filter
fields:
- Hostname
- EventID
- ObjectServer
- ObjectType
- SubjectUserSid
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-gMSA password dump - GoldenGMSA.yaml
x_legacy_id: winlog-9000-0042
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0042-group_managed_service_accounts_password_dump_goldengmsa.yml
