title: Domain group enumeration
id: winlog-0067
status: experimental
rule_origin: public
description: Detects scenarios where an attacker enumerates domain group with tools like CME (--groups).
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0007-Discovery/T1069-Permission%20Groups%20Discovery
- https://hideandsec.sh/books/cheatsheets/page/crackmapexec
- https://www.infosecmatter.com/crackmapexec-module-library/
- https://docs.microsoft.com/en-us/windows/win32/adschema/extended-rights
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0007
- attack.t1069.002
- attack.t1087.002
- attack.discovery
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4662
    ObjectType|contains: '{bf967a9c-0de6-11d0-a285-00aa003049e2}'
    ObjectServer: DS
    OperationType: Object Access
  filter:
    SubjectUserName|endswith: $
  condition: selection and not filter
  timeframe: 15m
fields:
- Hostname
- EventID
- ObjectServer
- ObjectType
- OperationType
- SubjectUserName
- ObjectName
unique_fields:
- Hostname
falsepositives:
- Administrator activity
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-group domain enumeration (CME).yaml
x_legacy_id: winlog-9000-0043
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0043-domain_group_enumeration.yml
