title: Active Directory honeypot used for lateral movement
id: winlog-0070
status: experimental
rule_origin: public
description: Detects scenarios where an attacker is using
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0007-Discovery/T1087-Account%20discovery
- http://www.labofapenetrationtester.com/2018/10/deploy-deception.html
- https://jblog.javelin-networks.com/blog/the-honeypot-buster/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0008
- attack.t1021
- attack.lateral_movement
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
    - 4624
    - 4625
    - 4768
    - 4769
    - 4770
    - 4771
    - 5140
    - 5145
    TargetUserName: '%honeypot_account_list%'
  condition: selection
fields:
- Hostname
- EventID
- TargetUserName
unique_fields:
- Hostname
falsepositives:
- pentest
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-honeypot object usage detected.yaml
x_legacy_id: winlog-9000-0046
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0046-active_directory_honeypot_used_for_lateral_movement.yml
