title: Local domain group enumeration
id: winlog-0072
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to enumerate domain local groups with tools like CME (--local-groups).
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0007-Discovery/T1069-Permission%20Groups%20Discovery
- https://hideandsec.sh/books/cheatsheets/page/crackmapexec
- https://www.infosecmatter.com/crackmapexec-module-library/
- https://docs.microsoft.com/en-us/windows/win32/adschema/extended-rights?redirectedfrom=MSDN
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0007
- attack.t1069.001
- attack.t1087.001
- attack.discovery
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4661
    ProcessName|endswith: \lsass.exe
    ObjectServer: Security Account Manager
    ObjectType: SAM_ALIAS
    ObjectName|startswith:
    - S-1-5-32-
    - S-1-5-21-
  filter:
    SubjectUserName|endswith: $
  condition: selection and not filter
  timeframe: 15m
fields:
- Hostname
- EventID
- ObjectName
- ObjectServer
- ObjectType
- ProcessName
- SubjectUserName
- IpAddress
unique_fields:
- IpAddress
falsepositives:
- Administrator activity
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-local group enumeration (CME).yaml
x_legacy_id: winlog-9000-0048
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0048-local_domain_group_enumeration.yml
