title: NetSYnc attack
id: winlog-0076
status: experimental
rule_origin: public
description: NetSync allows an attacker to take the NTLM hash of a Domain Controller (DC) machine account ("usually" identified
  by ending in "$") and using it to obtain the NTLM machine account hash of another machine account through impersonation
  (similar to, but different from, DCSync). Where DCSync can obtain user account passwords, NetSync is limited to machine
  accounts. The other main differentiator between DCSync and NetSync is that DCSync will make use of Microsoft's Directory
  Replication Service (DRS) Remote Protocol, whereas NetSync uses the older Netlogon Remote Protocol (MS-NRPC)
references:
- https://github.com/Neo23x0/sigma/blob/c56cd2dfff6343f3694ef4fd606a305415599737/rules-unsupported/win_dumping_ntdsdit_via_netsync.yml
- https://fr.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- https://www.trustedsec.com/blog/the-tale-of-the-lost-but-not-forgotten-undocumented-netsync-part-1/
- https://www.trustedsec.com/blog/the-tale-of-the-lost-but-not-forgotten-undocumented-netsync-part-2/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1003.006
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection_login:
    EventID: 4624
    Hostname: '%domain_controllers%'
    TargetUserSid: S-1-5-21-
    LogonType: 3
    AuthenticationPackageName: Kerberos
  selection_share:
    EventID: 5145
    Hostname: '%domain_controllers%'
    ShareName: \\*\IPC$
    RelativeTargetName: NETLOGON
  filter:
  - SubjectUserName|endswith: $
  - SubjectUserSid: S-1-5-7
  - IpAddress:
    - '%domain_controllers%'
    - '%exchange_servers%'
  condition: selection_login and not filter
fields:
- Hostname
- AuthenticationPackageName
- EventID
- IpAddress
- LogonType
- RelativeTargetName
- ShareName
- SubjectUserName
- SubjectUserSid
- TargetUserSid
unique_fields:
- Hostname
falsepositives:
- Exchange servers
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-netsync attack.yaml
x_legacy_id: winlog-9000-0052
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0052-netsync_attack.yml
