title: Domain password policy enumeration
id: winlog-0077
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to enumerate the domain password policy with native commands or
  tools like CME (--pass-pol).
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0007-Discovery/T1201-Password%20Policy%20Discovery
- https://hideandsec.sh/books/cheatsheets/page/crackmapexec
- https://www.infosecmatter.com/crackmapexec-module-library/
- https://github.com/PSGumshoe/PSGumshoe/blob/master/DirectoryService/PrivateFunctions.ps1
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0007
- attack.t1201
- attack.discovery
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4661
    ProcessName|endswith: \lsass.exe
    ObjectServer: Security Account Manager
    ObjectName|startswith: DC=
    ObjectType: SAM_DOMAIN
    Properties|contains|all:
    - c7407360-20bf-11d0-a768-00aa006e0529
    - bf9679a4-0de6-11d0-a285-00aa003049e2
    - bf9679a5-0de6-11d0-a285-00aa003049e2
    - bf9679a6-0de6-11d0-a285-00aa003049e2
    - bf9679bb-0de6-11d0-a285-00aa003049e2
    - bf9679c2-0de6-11d0-a285-00aa003049e2
    - bf9679c3-0de6-11d0-a285-00aa003049e2
    - bf967a09-0de6-11d0-a285-00aa003049e2
    - bf967a0b-0de6-11d0-a285-00aa003049e2
    - bf967977-0de6-11d0-a285-00aa003049e2
  filter:
    SubjectUserName|endswith: $
  condition: selection and not filter
fields:
- Hostname
- EventID
- ObjectName
- ObjectServer
- ObjectType
- ProcessName
- Properties
- SubjectUserName
unique_fields:
- Hostname
falsepositives:
- Administrator activity
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-password domain policy enumeration.yaml
x_legacy_id: winlog-9000-0053
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0053-domain_password_policy_enumeration.yml
