title: Remote domain controller password reset (Zerologon)
id: winlog-0078
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to exploit the Zerologon vulnerabiliy which triggers, bsides others
  things, a password reset on a domain controller.
references:
- https://thedfirreport.com/2022/11/14/bumblebee-zeros-in-on-meterpreter/
- https://stealthbits.com/blog/zerologon-from-zero-to-hero-part-2/
- https://www.lares.com/blog/from-lares-labs-defensive-guidance-for-zerologon-cve-2020-1472/
- https://blog.nviso.eu/2020/09/17/sentinel-query-detect-zerologon-cve-2020-1472/
- https://blog.zsec.uk/zerologon-attacking-defending/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0008
- attack.t1210
- attack.lateral_movement
logsource:
  product: windows
  service: security
detection:
  domain_controller:
    Hostname: '%domain_controllers%'
  selection_account_changed:
    EventID: 4742
    TargetUserName|endswith: $
  filter_account_changed:
    PasswordLastSet: '-'
  selection_reset:
    EventID: 4724
  condition: domain_controller and (selection_reset or (selection_account_changed and not filter_account_changed) )
fields:
- Hostname
- EventID
- PasswordLastSet
- TargetUserName
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-password reset on a domain controller (Zero logon).yaml
x_legacy_id: winlog-9000-0054
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0054-remote_domain_controller_password_reset_zerologon.yml
