title: Privilege SeMachineAccountPrivilege abuse
id: winlog-0079
status: experimental
rule_origin: public
description: Detects scenarios where an attacker abuse the SeMachineAccountPrivilege which allows per default any authenticated
  user to join a computer to the domain. Later on, this computer account can be manipulated in order to elevate privileges.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0004-Privilege%20Escalation/T1068-Exploitation%20for%20Privilege%20Escalation
- https://exploit.ph/cve-2021-42287-cve-2021-42278-weaponisation.html
- https://www.thehacker.recipes/ad/movement/kerberos/samaccountname-spoofing
- https://support.microsoft.com/en-us/topic/kb5008380-authentication-updates-cve-2021-42287-9dafac11-e0d0-4cb8-959a-143bd0201041
- https://github.com/WazeHell/sam-the-admin
- https://github.com/cube0x0/noPac
- https://github.com/ly4k/Pachine
- https://cloudbrothers.info/en/exploit-kerberos-samaccountname-spoofing/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0004
- attack.t1068
- attack.t1098
- attack.privilege_escalation
- attack.persistence
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4673
    PrivilegeList: SeMachineAccountPrivilege
  filter:
  - SubjectUserSid: S-1-5-18
  - SubjectUserName: '%admin_acounts%'
  condition: selection and not filter
fields:
- Hostname
- EventID
- PrivilegeList
- SubjectUserName
- SubjectUserSid
unique_fields:
- Hostname
falsepositives:
- Users (shouldn't) or administrators joining a computer to the domain, server provisionning software
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-privilege SeMachineAccountPrivilege abuse.yaml
x_legacy_id: winlog-9000-0055
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0055-privilege_semachineaccountprivilege_abuse.yml
