title: SPN added to an account by command line
id: winlog-0085
status: experimental
rule_origin: public
description: Detects scenarios where an attacker adds a SPN to an account in order to perform different type of abuse (Kerberoast,
  delegation abuse, ...)
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
- https://petri.com/how-to-use-setspn-to-set-active-directory-service-principal-names-2
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1098
- attack.persistence
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    NewProcessName|endswith: \setspn.exe
    CommandLine|contains:
    - '/a '
    - '-a '
    - '/s '
    - '-s '
  condition: selection
fields:
- Hostname
- CommandLine
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- Administrators adding SPN
- SPN linked to a load balancer
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-spn added to an account (command).yaml
x_legacy_id: winlog-9000-0061
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0061-spn_added_to_an_account_by_command_line.yml
