title: Suspicious modification of a fake domain controller SPN (DCshadow) (Directory Services)
id: winlog-0088
status: experimental
rule_origin: public
description: Detects scenarios where an attacker update the Service Principal Name (SPN) of a computer account in order to
  perform "Kerberos redirection" and escalate privileges.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
- https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/t1207-creating-rogue-domain-controllers-with-dcshadow
- https://medium.com/@maarten.goet/dcshadow-detecting-a-rogue-domain-controller-replicating-malicious-changes-to-your-active-1e22440df9ad
- https://github.com/AlsidOfficial/UncoverDCShadow
- https://github.com/shellster/DCSYNCMonitor
- https://blog.alsid.eu/dcshadow-explained-4510f52fc19d
- https://stealthbits.com/blog/detecting-dcshadow-with-event-logs/
- https://www.labofapenetrationtester.com/2018/05/dcshadow-sacl.html
- https://blog.stealthbits.com/creating-persistence-with-dcshadow/
- https://book.hacktricks.xyz/windows/active-directory-methodology/dcshadow
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1098
- attack.persistence
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5136
    AttributeLDAPDisplayName: servicePrincipalName
    ObjectClas: computer
    OperationType: '%%14674'
    AttributeValue|startswith: GC/
  condition: selection
fields:
- Hostname
- AttributeLDAPDisplayName
- AttributeValue
- EventID
- ObjectClas
- OperationType
unique_fields:
- Hostname
falsepositives:
- Rare administrator modifications on user objects
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-spn modification of a computer account (DCshadow) (Directory Services).yaml
x_legacy_id: winlog-9000-0064
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0064-suspicious_modification_of_a_fake_domain_controller_spn_dcshadow_directo.yml
