title: User account created by a computer account
id: winlog-0092
status: experimental
rule_origin: public
description: Detects scenarios where an attacker would abuse some privileges while realying host credentials to escalate privileges.
references:
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4741
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1136
- attack.t1036
- attack.persistence
- attack.defense_evesion
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4720
    SubjectUserName|endswith: $
    SubjectUserSid|startswith: S-1-5-21-
  filter:
    TargetUserName|endswith: $
  condition: selection
fields:
- Hostname
- EventID
- SubjectUserName
- SubjectUserSid
- TargetUserName
unique_fields:
- Hostname
falsepositives:
- Exchange servers
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-user account created by a computer account.yaml
x_legacy_id: winlog-9000-0068
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0068-user_account_created_by_a_computer_account.yml
