title: User password change using current hash password - ChangeNTLM (Mimikatz)
id: winlog-0094
status: experimental
rule_origin: public
description: Detects scenarios where an attacker resets a user account by using the compromised NTLM password hash. The newly
  clear text password defined by the attacker can be then used in order to login into services like Outlook Web Access (OWA),
  RDP, SharePoint... As ID 4723 refers to user changing is own password, the SubjectSid and TargetSid should be equal. However
  in a change initiated by Mimikatz, they will be different. Correlate the event ID 4723, 4624 and 5145 using the "SubjectLogonId"
  field to identify the source of the reset.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
- https://stealthbits.com/blog/manipulating-user-passwords-with-mimikatz/
- https://www.trustedsec.com/blog/azure-account-hijacking-using-mimikatzs-lsadumpsetntlm/
- https://www.trustedsec.com/blog/manipulating-user-passwords-without-mimikatz/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1098
- attack.persistence
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4723
    TargetSid|startswith: S-1-5-21-
    SubjectUserSid|startswith: S-1-5-21-
  condition: selection
fields:
- Hostname
- EventID
- SubjectUserSid
- TargetSid
unique_fields:
- Hostname
falsepositives:
- Admin changing is own account directly using the Active Directory console and not the GUI (ctrl alt suppr)
- ADFS, MSOL, DirSync, Azure AD Sync
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-user password change with changeNTLM (Mimikatz).yaml
x_legacy_id: winlog-9000-0070
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0070-user_password_change_using_current_hash_password_changentlm_mimikatz.yml
