title: User password change without previous password known - SetNTLM (Mimikatz)
id: winlog-0095
status: experimental
rule_origin: public
description: Detects scenarios where an attacker perform a password reset event. This does not require any knowledge of a
  user’s current password, but it does require to have the "Reset Password" right. Correlate the event ID 4724, 4624 and 5145
  using the "SubjectLogonId" field to identify the source of the reset.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
- https://stealthbits.com/blog/manipulating-user-passwords-with-mimikatz/
- https://www.trustedsec.com/blog/azure-account-hijacking-using-mimikatzs-lsadumpsetntlm/
- https://www.trustedsec.com/blog/manipulating-user-passwords-without-mimikatz/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1098
- attack.persistence
logsource:
  product: windows
  service: security
detection:
  selection_reset:
    EventID: 4724
    TargetSid|startswith: S-1-5-21-
    SubjectUserSid|startswith: S-1-5-21-
  selection_share:
    EventID: 5145
    ShareName: \\*\IPC$
    RelativeTargetName: samr
  selection_login:
    EventID: 4624
    AuthenticationPackageName: NTLM
  filter:
    IpAddress:
    - 127.0.0.1
    - ::1
  condition: selection_reset and not filter
fields:
- Hostname
- AuthenticationPackageName
- EventID
- IpAddress
- RelativeTargetName
- ShareName
- SubjectUserSid
- TargetSid
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-user password change with setNTLM (Mimikatz).yaml
x_legacy_id: winlog-9000-0071
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0071-user_password_change_without_previous_password_known_setntlm_mimikatz.yml
