title: Account set with Kerberos pre-authentication not required (AS-REP Roasting)
id: winlog-0100
status: experimental
rule_origin: public
description: Detects scenarios where an attacker set an account with Kerberos pre-authentication not required to perform offline
  brutforce. Account with this status can be checked with the following command > "Get-ADUser -Filter 'useraccountcontrol
  -band 4194304' -Properties useraccountcontrol".
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
- https://social.technet.microsoft.com/wiki/contents/articles/23559.kerberos-pre-authentication-why-it-should-not-be-disabled.aspx
- https://docs.microsoft.com/en-us/services-hub/health/remediation-steps-ad/remove-the-highly-insecure-des-encryption-from-user-accounts
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1098
- attack.persistence
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4738
    UserAccountControl|contains: '%%2096'
  condition: selection
fields:
- Hostname
- EventID
- UserAccountControl
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-user set with Kerberos pre-authentication not required (AS-REP Roasting).yaml
x_legacy_id: winlog-9000-0076
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0076-account_set_with_kerberos_pre_authentication_not_required_as_rep_roastin.yml
