title: RDP Login Connect Brute
id: winlog-0101-0001
status: experimental
description: A RDP-Tcp connect create from remote client(this is the first event log if using RDP)
references:
    - https://rdp.conn.ada.com
author: frack113
date: 2021/12/12
modified: 2023/02/14
tags:
    - TA0007
logsource: winlog
detection:
    selection1:
        Channel: "Microsoft-Windows-TerminalServices-RemoteConnectionManager/Operational"
        EventID: 261
    filter1:
        IpAddress:
            - "::1"
            - "fe80"
            - "127.0.0.1"
    condition: selection1 and not filter1
fields:
    - "Hostname"
    - "AccountName"
unique_fields:
    - "Hostname"
    - "AccountName"
level: info
