title: RDP Login Failed
id: winlog-0101-0002
status: experimental
description: This is some description here
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.001/T1069.001.md
author: frack113
date: 2021/12/12
modified: 2023/02/14
tags:
    - TA0007
      - attack.t1069.001
logsource: winlog
detection:
    selection1:
        EventID: 4625
        LogonType: 3
    filter1:
        IpAddress:
            - "::1"
            - "fe80"
            - "127.0.0.1"
    condition: selection1 and not filter1
fields:
    - "Hostname"
    - "TargetUserName"
    - "IpAddress"
unique_fields:
    - "Hostname"
    - "IpAddress"
level: low
