title: Kerberos Pre-authentication Failed
id: winlog-0101-0004
status: experimental
description: This is some description here
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.001/T1069.001.md
author: frack113
date: 2021/12/12
modified: 2023/02/14
tags:
    - TA0007
logsource: winlog
detection:
    selection1:
        EventID: 4771
        Severity: "ERROR"
    filter1:
        IpAddress:
            - "::1"
            - "fe80"
            - "127.0.0.1"
    filter2:
        TargetUserName|endswith: "$"
    condition: selection1 and not filter1 and not filter2
fields:
    - "Hostname"
    - "TargetUserName"
    - "IpAddress"
unique_fields:
    - "Hostname"
    - "IpAddress"
level: low
