title: Account set with password not required (weakness introduction)
id: winlog-0101
status: experimental
rule_origin: public
description: Detects scenarios where an attacker set an account with password not required to perform privilege escalation
  attack.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
- https://github.com/Azure/Azure-Sentinel/blob/master/Detections/SecurityEvent/password_never_expires.yaml
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1098
- attack.persistence
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4738
    UserAccountControl|contains: '%%2082'
  condition: selection
fields:
- Hostname
- EventID
- UserAccountControl
unique_fields:
- Hostname
falsepositives:
- IAM solutions generating accounts
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-user set with password not required.yaml
x_legacy_id: winlog-9000-0077
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0077-account_set_with_password_not_required_weakness_introduction.yml
