title: Account set with reversible encryption (weakness introduction)
id: winlog-0102
status: experimental
rule_origin: public
description: Detects scenarios where an attacker set an account with reversible encryption to facilitate brutforce or cracking
  operations.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
- https://www.blackhillsinfosec.com/how-i-cracked-a-128-bit-password/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1098
- attack.persistence
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4738
    UserAccountControl|contains: '%%2091'
  condition: selection
fields:
- Hostname
- EventID
- UserAccountControl
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-user set with reversible password encryption.yaml
x_legacy_id: winlog-9000-0078
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0078-account_set_with_reversible_encryption_weakness_introduction.yml
