title: A scheduled task was created
id: winlog-0103-0003
status: test
description: Detects usage of windows powershell executed
references:
    - https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
author: Michael
date: 2017/03/09
modified: 2023/02/15
tags:
    - TA0003
logsource: winlog
detection:
    selection_source:
        Channel: "Security"
        EventID: 4698
    filter_ignore:
        TaskName|contains:
            - "UpdateOrchestrator"
            - "GoogleUpdater"
            - "CreateExplorerShellUnelevatedTask"
            - "Windows Defender Scheduled Scan"
    condition: selection_source and not filter_ignore
fields:
    - "Hostname"
    - "SubjectUserName"
    - "SubjectUserSid"
    - "TaskName"
unique_fields:
    - "Hostname"
    - "SubjectUserName"
level: medium
