title: Azure Active Directory Connect credentials dump via network share
id: winlog-0103
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempt to dump Azure Active Directory Connect credentials via network share.
references:
- https://github.com/fox-it/adconnectdump
- https://o365blog.com/post/adsync/
- https://dirkjanm.io/updating-adconnectdump-a-journey-into-dpapi/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1555
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5145
    ShareName: \\*\C$
    RelativeTargetName|contains: \Windows\ServiceProfiles\ADSync\AppData\Local\Microsoft\Credentials\
  condition: selection
fields:
- Hostname
- EventID
- RelativeTargetName
- ShareName
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-azure/win-os-AD Connect credentials dump via network share.yaml
x_legacy_id: winlog-9000-0079
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0079-azure_active_directory_connect_credentials_dump_via_network_share.yml
