title: powershell command execution
id: winlog-0103-0015
status: test
description: |
    Detects suspicious reconnaissance command line activity on Windows systems using Net.EXE
    Check if the user that executed the commands is suspicious (e.g. service accounts, LOCAL_SYSTEM)
references:
    - https://redcanary.com/blog/how-one-hospital-thwarted-a-ryuk-ransomware-outbreak/
    - https://thedfirreport.com/2020/10/18/ryuk-in-5-hours/
    - https://research.nccgroup.com/2022/08/19/back-in-black-unlocking-a-lockbit-3-0-ransomware-attack/
author: Michael
date: 2017/03/09
modified: 2023/02/15
tags:
    - TA0002
logsource: winlog
detection:
    selection_source:
        Channel: "Microsoft-Windows-PowerShell/Operational"
        EventID: 4104
        ParentProcessName|endswith:
            - "cmd.exe"
            - "net.exe"
            - "powershell.exe"
    condition: selection_source
fields:
    - "Hostname"
    - "AccountName"
    - "ScriptBlockText"
    - "SourceName"
unique_fields:
    - "Hostname"
    - "AccountName"
level: info
