title: Windows Powershell Script Executed
id: winlog-0103-0001
status: test
description: Detects usage of windows powershell executed
references:
    - https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
author: Michael
date: 2017/03/09
modified: 2023/02/15
tags:
    - TA0002
logsource: winlog
detection:
    selection_source:
        Channel: "Microsoft-Windows-PowerShell/Operational"
        EventID: 4104
    filter_path:
        Path|endswith: ".ps1"
    condition: selection_source and filter_path
fields:
    - "Hostname"
    - "AccountName"
    - "UserID"
    - "Path"
    - "ScriptBlockText"
unique_fields:
    - "Hostname"
    - "AccountName"
level: medium
