title: sensitive privilege used by process
id: winlog-0103-0016
status: test
description: |
    Detects suspicious reconnaissance command line activity on Windows systems using Net.EXE
    Check if the user that executed the commands is suspicious (e.g. service accounts, LOCAL_SYSTEM)
references:
    - https://redcanary.com/blog/how-one-hospital-thwarted-a-ryuk-ransomware-outbreak/
    - https://thedfirreport.com/2020/10/18/ryuk-in-5-hours/
    - https://research.nccgroup.com/2022/08/19/back-in-black-unlocking-a-lockbit-3-0-ransomware-attack/
author: Michael
date: 2017/03/09
modified: 2023/02/15
tags:
    - TA0004
logsource: winlog
detection:
    selection_source:
        Channel: "Security"
        EventID: 4673
        ParentProcessName|endswith:
            - "cmd.exe"
            - "net.exe"
    condition: selection_source
fields:
    - "Hostname"
    - "ProcessName"
    - "PrivilegeList"
    - "EventType"
    - "SubjectUserName"
    - "SubjectUserSid"
unique_fields:
    - "Hostname"
    - "SubjectUserName"
level: high
