title: A windows service was created
id: winlog-0103-0005
status: test
description: Detects usage of windows powershell executed
references:
  - https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
author: Michael
date: 2017/03/09
modified: 2023/02/15
tags:
  - TA0003
logsource:
  product: windows
  category: process_creation
detection:
  selection_source:
    Channel: "System"
    EventID: 7045
  filter_ignore:
    ServiceName|contains:
      - 'GoogleUpdater'
  condition: selection_source and not filter_ignore
fields:
  - 'Hostname'
  - 'AccountName'
  - 'ImagePath'
  - 'ServiceName'
unique_fields:
  - 'Hostname'
  - 'AccountName'
level: medium