title: Serial console process spawning CMD shell (via command)
id: winlog-0104
status: experimental
rule_origin: public
description: Detects if an attacker open a privileged CMD shell while accessing to an Azure virtual machine via serial cable.
references:
- https://www.mandiant.com/resources/blog/sim-swapping-abuse-azure-serial
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0002
- attack.t1059.003
- attack.execution
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    ParentImage|endswith: \sacsess.exe
    Image|endswith: \cmd.exe
  condition: selection
fields:
- Hostname
- Image
- ParentImage
unique_fields:
- Hostname
falsepositives:
- Virtual machine recovery by administrator
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-azure/win-os-cmd shell via serial cable (command).yaml
x_legacy_id: winlog-9000-0080
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0080-serial_console_process_spawning_cmd_shell_via_command.yml
