title: BITS payload downloaded via PowerShell
id: winlog-0108
status: experimental
rule_origin: public
description: Detects scenarios where an attacker downloads a payload by abusing BITS software. For more precise information,
  inspect "Bits-client" event log and search for ID 59 and 60.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1197-BITS%20jobs
- https://medium.com/@threathuntingteam/background-intelligent-transfer-protocol-ab81cd900aa7
- https://docs.microsoft.com/en-us/windows/win32/bits/bitsadmin-tool
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/bitsadmin-examples
- https://attack.mitre.org/software/S0190/
- https://www.microsoft.com/security/blog/2019/12/12/multi-stage-downloader-trojan-sload-abuses-bits-almost-exclusively-for-malicious-activities/
- https://medium.com/@threathuntingteam/background-intelligent-transfer-protocol-ab81cd900aa7
- https://www.hackingarticles.in/windows-for-pentester-bitsadmin/
- https://thedfirreport.com/2023/09/25/from-screenconnect-to-hive-ransomware-in-61-hours/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0010
- attack.t1048
- attack.t1570
- attack.t1105
- attack.t1197
- attack.exfiltration
- attack.lateral_movement
- attack.Command_and_control
- attack.persistence
logsource:
  product: windows
  category:
  - ps_module
  - ps_script
detection:
  selection2_powershell_modern:
    EventID: 4103
    Payload|contains|all:
    - Start-BitsTransfer
    - -Source
    Payload|contains:
    - http://
    - https://
    - ftp://
  selection3_powershell_block:
    EventID: 4104
    ScriptBlockText|contains|all:
    - Start-BitsTransfer
    - -Source
    ScriptBlockText|contains:
    - http://
    - https://
    - ftp://
  condition: 1 of selection*
fields:
- Hostname
- EventID
- Payload
- ScriptBlockText
unique_fields:
- Hostname
falsepositives:
- None
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-bits/win-os-BITS abuse for payload download (PowerShell).yaml
x_legacy_id: winlog-9000-0085
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0085-bits_payload_downloaded_via_powershell.yml
