title: BITS payload downloaded via commandline
id: winlog-0109
status: experimental
rule_origin: public
description: Detects scenarios where an attacker downloads a payload by abusing BITS software. For more precise information,
  inspect "Bits-client" event log and search for ID 59 and 60.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1197-BITS%20jobs
- https://medium.com/@threathuntingteam/background-intelligent-transfer-protocol-ab81cd900aa7
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/bitsadmin-examples
- https://www.microsoft.com/security/blog/2019/12/12/multi-stage-downloader-trojan-sload-abuses-bits-almost-exclusively-for-malicious-activities/
- https://medium.com/@threathuntingteam/background-intelligent-transfer-protocol-ab81cd900aa7
- https://www.hackingarticles.in/windows-for-pentester-bitsadmin/
- https://blog.talosintelligence.com/breaking-the-silence-recent-truebot-activity/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0010
- attack.t1048
- attack.t1570
- attack.t1105
- attack.t1197
- attack.exfiltration
- attack.lateral_movement
- attack.Command_and_control
- attack.persistence
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    NewProcessName|endswith: \bitsadmin.exe
    CommandLine|contains:
    - /transfer
    - /download
  condition: selection
fields:
- Hostname
- CommandLine
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- None
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-bits/win-os-BITS abuse for payload download (command).yaml
x_legacy_id: winlog-9000-0086
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0086-bits_payload_downloaded_via_commandline.yml
