title: Edge/Chrome headless feature abuse for payload download
id: winlog-0110
status: experimental
rule_origin: public
description: Detects scenarios where an attacker executes Chrome in headless mode in order to download a payload. Document
  Object Model (DOM) may also be abused to download obfuscated data from attacker repositary.
references:
- https://twitter.com/mrd0x/status/1478234484881436672?t=oVqHbDQx9fsc6yWmNTV3eA&s=09
- https://developers.google.com/web/updates/2017/04/headless-chrome
- https://developer.mozilla.org/en-US/docs/Web/API/Document_Object_Model
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0002
- attack.t1204
- attack.execution
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith:
    - \msedge.exe
    - \chrome.exe
    CommandLine|contains|all:
    - --dump-dom
    - --headless
  condition: selection
fields:
- Hostname
- CommandLine
- EventID
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-browser/win-browser-Edge & Chrome abuse to download payload via console.yaml
x_legacy_id: winlog-9000-0088
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0088-edge_chrome_headless_feature_abuse_for_payload_download.yml
