title: User browser credentials dump via network share (DonPapi, Lazagne)
id: winlog-0112
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempt to dump browser credentials (Firefox, Google Chrome, ...) via network
  share.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1555-Credentials%20from%20Password%20Stores
- https://github.com/login-securite/DonPAPI
- https://thedfirreport.com/2021/12/13/diavol-ransomware/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1555.003
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection_event:
    EventID: 5145
    ShareName: \\*\C$
  selection_browsers_credentials:
  - RelativeTargetName|endswith:
    - \AppData\Roaming\Mozilla\Firefox\Profiles\
    - \AppData\Local\Temp\edge-cookies.json
  - RelativeTargetName|contains:
    - \AppData\Local\Google\Chrome\User Data\
    - \AppData\Local\Microsoft\Edge\User Data\Default\Login Data\
    - \AppData\Local\Microsoft\Edge\User Data\Default\Cookies\
  condition: selection_event and selection_browsers_credentials
fields:
- Hostname
- EventID
- RelativeTargetName
- ShareName
unique_fields:
- Hostname
falsepositives:
- Roaming user profile, vulnerability scanners
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-browser/win-browser-credentials dump via network share (DonPapi, Lazagne).yaml
x_legacy_id: winlog-9000-0090
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0090-user_browser_credentials_dump_via_network_share_donpapi_lazagne.yml
