title: Microsoft Defender critical security components disabled (command)
id: winlog-0114
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to disable Defender security features
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1562.001-Impair%20Defenses-Disable%20or%20Modify%20tool
- https://github.com/swagkarna/Defeat-Defender-V1.2
- https://docs.microsoft.com/en-us/powershell/module/defender/set-mppreference?view=windowsserver2019-ps
- https://docs.microsoft.com/en-us/windows/client-management/mdm/defender-csp
- https://powershell.one/wmi/root/microsoft/windows/defender/msft_mppreference
- https://gist.github.com/pe3zx/7c5e0080c3b0869ccba1f1dc2ea0c5e0
- https://research.nccgroup.com/2022/08/19/back-in-black-unlocking-a-lockbit-3-0-ransomware-attack/
- https://cloudbrothers.info/en/current-limits-defender-av-tamper-protection/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0005
- attack.t1562.001
- attack.defense_evasion
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    EventID: 4688
    EventData|contains|all:
    - Set-MpPreference
    - Add-MpPreference
    CommandLine|contains:
    - DisableRealtimeMonitoring
    - DisableBehaviorMonitoring
    - DisableIOAVProtection
    - DisableIntrusionPreventionSystem
    - DisableInboundConnectionFiltering
  condition: selection
fields:
- Hostname
- CommandLine
- EventData
- EventID
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-defender/defender-critical security components disabled (command).yaml
x_legacy_id: winlog-9000-0092
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0092-microsoft_defender_critical_security_components_disabled_command.yml
