title: Microsoft Defender default action changed to allow any threat (command)
id: winlog-0116
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to change Defender default action to allow any threats
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1562.001-Impair%20Defenses-Disable%20or%20Modify%20tool
- https://github.com/swagkarna/Defeat-Defender-V1.2
- https://docs.microsoft.com/en-us/powershell/module/defender/set-mppreference?view=windowsserver2019-ps
- https://docs.microsoft.com/en-us/windows/client-management/mdm/defender-csp
- https://powershell.one/wmi/root/microsoft/windows/defender/msft_mppreference
- https://gist.github.com/pe3zx/7c5e0080c3b0869ccba1f1dc2ea0c5e0
- https://cloudbrothers.info/en/current-limits-defender-av-tamper-protection/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0005
- attack.t1562.001
- attack.defense_evasion
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    EventID: 4688
    CommandLine|contains:
    - HighThreatDefaultAction
    - ModerateThreatDefaultAction
    - LowThreatDefaultAction
    - SevereThreatDefaultAction
    - UnknownThreatDefaultAction
    - ThreatIDDefaultAction_Actions
  condition: selection
fields:
- Hostname
- CommandLine
- EventID
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-defender/defender-default action allow any threat (command).yaml
x_legacy_id: winlog-9000-0094
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0094-microsoft_defender_default_action_changed_to_allow_any_threat_command.yml
