title: Microsoft Defender service components status disabled (Registry via Sysmon)
id: winlog-0119
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to disable Defender security features by modifying service configuration
  in registry.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1562.001-Impair%20Defenses-Disable%20or%20Modify%20tool
- https://www.securityartwork.es/2021/09/27/trustedinstaller-parando-windows-defender/
- https://github.com/lab52io/StopDefender
- https://github.com/APTortellini/DefenderSwitch
- https://twitter.com/malwarelab_eu/status/1531536165458825219
- https://cloudbrothers.info/en/current-limits-defender-av-tamper-protection/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0005
- attack.t1562.001
- attack.defense_evasion
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    EventID: 13
    EventType: SetValue
    TargetObject|endswith:
    - \SYSTEM\CurrentControlSet\Services\wscsvc\Start
    - \SYSTEM\CurrentControlSet\Services\SecurityHealthService\Start
    - \SYSTEM\CurrentControlSet\Services\Sense\Start
    - \SYSTEM\CurrentControlSet\Services\WdBoot\Start
    - \SYSTEM\CurrentControlSet\Services\WdFilter\Start
    - \SYSTEM\CurrentControlSet\Services\WdNisDrv\Start
    - \SYSTEM\CurrentControlSet\Services\WdNisSvc\Start
    - \SYSTEM\CurrentControlSet\Services\WinDefend\Start
    Details|contains:
    - '0x00000003'
    - '0x00000004'
  condition: selection
fields:
- Hostname
- Details
- EventID
- EventType
- TargetObject
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-defender/defender-service components disabled (Reg via Sysmon).yaml
x_legacy_id: winlog-9000-0100
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0100-microsoft_defender_service_components_status_disabled_registry_via_sysmo.yml
