title: Microsoft Defender service deactivation attempt (command)
id: winlog-0120
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to disable Defender security service. If tamper protection is enabled,
  this action may not work.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1562.001-Impair%20Defenses-Disable%20or%20Modify%20tool
- https://github.com/swagkarna/Defeat-Defender-V1.2
- https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/microsoft-defender-antivirus-on-windows-server?view=o365-worldwide
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0005
- attack.t1562.001
- attack.defense_evasion
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    NewProcessName|endswith: \sc.exe
    CommandLine|contains|all:
    - sc
    - config
    - disabled
    CommandLine|contains:
    - WinDefend
    - Sense
    - MpsSvc
  condition: selection
fields:
- Hostname
- CommandLine
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-defender/defender-service deactivation attempt (command).yaml
x_legacy_id: winlog-9000-0101
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0101-microsoft_defender_service_deactivation_attempt_command.yml
