title: Microsoft Defender threat exclusion added (PowerShell)
id: winlog-0121
status: experimental
rule_origin: public
description: Detects scenarios where a threat exclusion is added to the antivirus in order to bypass its detection capacities
references:
- https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-antivirus/troubleshoot-microsoft-defender-antivirus
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1562.001-Impair%20Defenses-Disable%20or%20Modify%20tool
- https://thedfirreport.com/2020/11/23/pysa-mespinoza-ransomware/
- https://cloudbrothers.info/en/current-limits-defender-av-tamper-protection/
- https://www.intrinsec.com/apt27-analysis/
- https://cybersecuritynews-com.cdn.ampproject.org/c/s/cybersecuritynews.com/u-s-federal-network-hacked/?amp
- https://thedfirreport.com/2023/10/30/netsupport-intrusion-results-in-domain-compromise/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0005
- attack.t1562.001
- attack.defense_evasion
logsource:
  product: windows
  category:
  - ps_module
  - ps_script
detection:
  selection2_powershell_modern:
    EventID: 4103
    Payload|contains|all:
    - Add-MpPreference
    - Set-MpPreference
    Payload|contains:
    - ExclusionPath
    - ExclusionExtension
    - ExclusionProcess
    - ExclusionIpAddress
  selection3_powershell_block:
    EventID: 4104
    ScriptBlockText|contains|all:
    - Add-MpPreference
    - Set-MpPreference
    ScriptBlockText|contains:
    - ExclusionPath
    - ExclusionExtension
    - ExclusionProcess
    - ExclusionIpAddress
  condition: 1 of selection*
fields:
- Hostname
- EventID
- Payload
- ScriptBlockText
unique_fields:
- Hostname
falsepositives:
- Unknown
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-defender/defender-threat exclusion added (PowerShell).yaml
x_legacy_id: winlog-9000-0102
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0102-microsoft_defender_threat_exclusion_added_powershell.yml
