title: DLL ServerLevelPluginDll command installation
id: winlog-0122
status: experimental
rule_origin: public
description: Detects scenarios where a DLL is loaded by the DNS server in order to escalate privileges or initiate a remote
  shell.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1574-Hijack%20Execution%20Flow
- https://medium.com/@esnesenon/feature-not-bug-dnsadmin-to-dc-compromise-in-one-line-a0f779b8dc83
- https://medium.com/r3d-buck3t/escalating-privileges-with-dnsadmins-group-active-directory-6f7adbc7005b
- https://medium.com/techzap/dns-admin-privesc-in-active-directory-ad-windows-ecc7ed5a21a2
- https://phackt.com/dnsadmins-group-exploitation-write-permissions
- http://www.labofapenetrationtester.com/2017/05/abusing-dnsadmins-privilege-for-escalation-in-active-directory.html
- https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/from-dnsadmins-to-system-to-domain-compromise
- http://www.labofapenetrationtester.com/2017/05/abusing-dnsadmins-privilege-for-escalation-in-active-directory.html
- https://lolbas-project.github.io/lolbas/Binaries/Dnscmd/
- https://blog.3or.de/hunting-dns-server-level-plugin-dll-injection.html
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: Florian Roth (shortly adapted my mdecrevoisier)
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1574.002
- attack.persistence
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    NewProcessName|endswith: \dnscmd.exe
    CommandLine|contains|all:
    - /config
    - /serverlevelplugindll
  condition: selection
fields:
- Hostname
- CommandLine
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- None
level: critical
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-dns/win-dns-ServerLevelPluginDLL installation (command).yaml
x_legacy_id: winlog-9000-0104
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0104-dll_serverlevelplugindll_command_installation.yml
