title: New member added to an Exchange administration group (high risk)
id: winlog-0127
status: experimental
rule_origin: public
description: Detects scenarios where a new member is added to a sensitive group related to Exchange server
references:
- https://msexchangeguru.com/2015/12/18/rbac-2016/
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1098
- attack.persistence
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
    - 4728
    - 4756
    - 4732
    TargetUserName:
    - Exchange Organization Administrators
    - Exchange Public Folder Administrators
    - Exchange Recipient Administrators
    - Security Administrator
    - Exchange Domain Servers
    - Exchange Enterprise Servers
    - Exchange Servers
  condition: selection
fields:
- Hostname
- EventID
- TargetUserName
unique_fields:
- Hostname
falsepositives:
- Exchange administrator updating server configuration
- Exchange upgrade or migration
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-exchange/win-exchange-group membership change (high risk).yaml
x_legacy_id: winlog-9000-0112
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0112-new_member_added_to_an_exchange_administration_group_high_risk.yml
