title: Firewall configuration enumerated (command)
id: winlog-0131
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to extract current Windows firewall configuration to prepare an
  attack.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0007-Discovery/T1016-System%20Network%20Configuration%20Discovery
- https://docs.microsoft.com/en-us/troubleshoot/windows-server/networking/netsh-advfirewall-firewall-control-firewall-behavior
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0007
- attack.t1016
- attack.discovery
logsource:
  product: windows
  category: process_creation
detection:
  selection_event:
    EventID: 4688
    NewProcessName|endswith: \netsh.exe
  selection_command:
    Commandline|contains|all:
    - netsh
    - advfirewall
    - show
  selection_obfuscated:
    Commandline|contains|all:
    - netsh
    - show
    - ' a*'
  condition: selection_event and (selection_command or selection_obfuscated)
fields:
- Hostname
- Commandline
- EventID
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- Administrator activity
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-firewall/win-os-firewall configuration enumerated (command).yaml
x_legacy_id: winlog-9000-0118
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0118-firewall_configuration_enumerated_command.yml
