title: Firewall deactivation (modern command)
id: winlog-0134
status: experimental
rule_origin: public
description: Detects scenarios where an attacker disabled the Windows Firewall to evade defense.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1562.004-Impair%20Defenses-Disable%20or%20Modify%20System%20Firewall
- https://www.winhelponline.com/blog/enable-and-disable-windows-firewall-quickly-using-command-line/
- https://research.checkpoint.com/2022/check-point-research-detects-crypto-miner-malware-disguised-as-google-translate-desktop-and-other-legitimate-applications/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0005
- attack.t1562.004
- attack.defense_evasion
logsource:
  product: windows
  category: process_creation
detection:
  selection_event:
    EventID: 4688
    NewProcessName|endswith: \netsh.exe
  selection_command:
    Commandline|contains|all:
    - netsh
    - advfirewall
    - set
    - state
    - 'off'
  selection_obfuscated:
    Commandline|contains|all:
    - netsh
    - ' a*'
    - ' s*'
    - state
    - 'off'
  condition: selection_event and (selection_command or selection_obfuscated)
fields:
- Hostname
- Commandline
- EventID
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- Administrator activity
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-firewall/win-os-firewall deactivation (modern command).yaml
x_legacy_id: winlog-9000-0122
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0122-firewall_deactivation_modern_command.yml
