title: Firewall rule creation (command)
id: winlog-0135
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to create a firewall rule to allow unauthorized communications.
references:
- https://research.checkpoint.com/2022/check-point-research-detects-crypto-miner-malware-disguised-as-google-translate-desktop-and-other-legitimate-applications/
- https://thedfirreport.com/2023/10/30/netsupport-intrusion-results-in-domain-compromise/
- https://www.sygnia.co/blog/china-nexus-threat-group-velvet-ant/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0005
- attack.t1562.004
- attack.defense_evasion
logsource:
  product: windows
  category: process_creation
detection:
  selection_event:
    EventID: 4688
    NewProcessName|endswith: \netsh.exe
    Commandline|contains|all:
    - netsh
    - firewall
    - add
  condition: selection_event
fields:
- Hostname
- Commandline
- EventID
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- Administrator activity
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-firewall/win-os-firewall rule creation (command).yaml
x_legacy_id: winlog-9000-0125
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0125-firewall_rule_creation_command.yml
