title: IIS Application Pool credential dumping
id: winlog-0136
status: experimental
rule_origin: public
description: Detects scenarios where an attacker
references:
- https://www.netspi.com/blog/technical/network-penetration-testing/decrypting-iis-passwords-to-break-out-of-the-dmz-part-1/
- https://www.netspi.com/blog/technical/network-penetration-testing/decrypting-iis-passwords-to-break-out-of-the-dmz-part-2/
- https://www.elastic.co/guide/en/security/current/microsoft-iis-service-account-password-dumped.html
- https://tdm.socprime.com/tdm/info/3n7KrfogcqRG/#sigma
- https://twitter.com/0gtweet/status/1588815661085917186
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier (adapted from Tim Rauch and Grzegorz Tworek feedback)
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1003
- attack.credential_access
logsource:
  category: process_creation
  product: windows
detection:
  selection_name:
  - Image|endswith: \appcmd.exe
  - OriginalFilename: appcmd.exe
  selection_arg:
    CommandLine|contains|all:
    - list
    - apppool
  condition: selection_name and selection_arg
fields:
- Hostname
- CommandLine
- Image
- OriginalFilename
unique_fields:
- Hostname
falsepositives:
- Unknown
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-iis/win-iis-configuration file harvesting (command).yaml
x_legacy_id: winlog-9000-0126
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0126-iis_application_pool_credential_dumping.yml
