title: LSASS credential dump with LSASSY (PowerShell)
id: winlog-0141
status: experimental
rule_origin: public
description: Detects scenarios where an attacker remotely dump LSASS credentials using the LSASSY tool.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
- https://github.com/Hackndo/lsassy
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1003.001
- attack.credential_access
logsource:
  product: windows
  category:
  - ps_module
  - ps_script
detection:
  selection_powershell_modern:
    EventID: 4103
    Payload|contains|all:
    - rundll32.exe
    - comsvcs.dll
    - lsass
  selection_powershell_block:
    EventID: 4104
    ScriptBlockText|contains|all:
    - rundll32.exe
    - comsvcs.dll
    - lsass
  condition: 1 of selection*
fields:
- Hostname
- EventID
- Payload
- ScriptBlockText
unique_fields:
- Hostname
falsepositives:
- legitimate administrator activation
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-lsass/win-os-LSASS credential dump with LSASSY (PowerShell).yaml
x_legacy_id: winlog-9000-0133
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0133-lsass_credential_dump_with_lsassy_powershell.yml
