title: LSASS credential dump with LSASSY (process)
id: winlog-0143
status: experimental
rule_origin: public
description: Detects scenarios where an attacker remotely dump LSASS credentials using the LSASSY tool.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
- https://github.com/Hackndo/lsassy
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1003.001
- attack.credential_access
logsource:
  product: windows
  category: process_creation
detection:
  selection_process_native:
    NewProcessName|endswith:
    - \rundll32.exe
    - \powershell.exe
    CommandLine|contains|all:
    - rundll32.exe
    - comsvcs.dll
  selection_sysmon_baseline:
    Image|endswith:
    - \rundll32.exe
    - \powershell.exe
    - \pwsh.exe
    - \powershell_ise.exe
  selection_sysmon_parent_process:
    ParentCommandLine:
    - rundll32.exe
    - comsvcs.dll
  selection_sysmon_process:
    CommandLine|contains|all:
    - rundll32.exe
    - comsvcs.dll
  condition: selection_process_native or (selection_sysmon_baseline and (selection_sysmon_parent_process or selection_sysmon_process))
fields:
- Hostname
- CommandLine
- Image
- NewProcessName
- ParentCommandLine
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-lsass/win-os-LSASS credential dump with LSASSY (process).yaml
x_legacy_id: winlog-9000-0135
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0135-lsass_credential_dump_with_lsassy_process.yml
