title: LSASS credential dump with LSASSY (admin share)
id: winlog-0144
status: experimental
rule_origin: public
description: Detects scenarios where an attacker remotely dump LSASS credentials using the LSASSY tool.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
- https://github.com/Hackndo/lsassy
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1003.001
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5145
    ShareName: \\*\C$
    RelativeTargetName|startswith: Windows
    RelativeTargetName|endswith: .dmp
  condition: selection
fields:
- Hostname
- EventID
- RelativeTargetName
- ShareName
unique_fields:
- Hostname
falsepositives:
- none
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-lsass/win-os-LSASS credential dump with LSASSY (share).yaml
x_legacy_id: winlog-9000-0136
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0136-lsass_credential_dump_with_lsassy_admin_share.yml
