title: Task Manager access indicator for potential LSASS dump
id: winlog-0145
status: experimental
rule_origin: public
description: Provides an indicator of a user accessing the task manager in order to eventually dump the LSASS process content
  using the "Details" tab > right click on "lsass.exe" > Create a dump file.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
- https://superuser.com/questions/753556/taskmgr-exe-called-with-an-argument-by-windows-7
- https://twitter.com/Cyb3rSn0rlax/status/1462900723402817538?t=oMj76JVcPG72ZIlpVxucPw&s=09
- https://thedfirreport.com/2021/12/13/diavol-ransomware/
- https://www.microsoft.com/en-us/security/blog/2022/06/13/the-many-lives-of-blackcat-ransomware/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1003.001
- attack.credential_access
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    NewProcessName|endswith: \Taskmgr.exe
    CommandLine|contains:
    - /4
    - /3
    - /2
    - /1
  condition: selection
fields:
- Hostname
- CommandLine
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- User accessing the Task Manager
level: low
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-lsass/win-os-LSASS dump indicator via Task Manager access.yaml
x_legacy_id: winlog-9000-0138
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0138-task_manager_access_indicator_for_potential_lsass_dump.yml
