title: NTFS hard link creation
id: winlog-0151
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to create a hard link.
references:
- https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4664
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1547.009
- attack.persistence
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    EventID: 4664
  condition: selection
fields:
- Hostname
- EventID
unique_fields:
- Hostname
falsepositives:
- admin activity on file server
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-ntfs/win-os-NTFS hard link creation (native).yaml
x_legacy_id: winlog-9000-0144
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0144-ntfs_hard_link_creation.yml
