title: NTFS symbolic link configuration change
id: winlog-0152
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to modify the type of symbolic link than can be created.
references:
- https://news.sophos.com/en-us/2022/08/10/lockbit-hive-and-blackcat-attack-automotive-supplier-in-triple-ransomware-attack/
- https://www.microsoft.com/en-us/security/blog/2022/06/13/the-many-lives-of-blackcat-ransomware/
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/fsutil-behavior
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1547.009
- attack.persistence
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    NewProcessName|endswith: \fsutil.exe
    CommandLine|contains|all:
    - behavior
    - set
  condition: selection
fields:
- Hostname
- CommandLine
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- admin activity on file server
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-ntfs/win-os-NTFS symbolic link configuration changed (command).yaml
x_legacy_id: winlog-9000-0145
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0145-ntfs_symbolic_link_configuration_change.yml
