title: OpenSSH server firewall configuration on Windows (PowerShell)
id: winlog-0156
status: experimental
rule_origin: public
description: Detects scenarios where an attacker configure the Windows firewall to allow incoming connections to perform stealthy
  lateral movement.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0008-Lateral%20Movement/T1021.004-Remote%20Service%20SSH
- https://winaero.com/enable-openssh-server-windows-10/
- https://docs.microsoft.com/en-us/windows-server/administration/openssh/openssh_install_firstuse
- https://virtualizationreview.com/articles/2020/05/21/ssh-server-on-windows-10.aspx
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0005
- attack.t1562.004
- attack.defense_evasion
logsource:
  product: windows
  category:
  - ps_module
  - ps_script
detection:
  selection_powershell_modern:
    EventID: 4103
    Payload|contains|all:
    - New-NetFirewallRule
    - LocalPort
    - '22'
    - Action
    - Allow
  selection_powershell_block:
    EventID: 4104
    ScriptBlockText|contains|all:
    - New-NetFirewallRule
    - LocalPort
    - '22'
    - Action
    - Allow
  condition: 1 of selection*
fields:
- Hostname
- EventID
- Payload
- ScriptBlockText
unique_fields:
- Hostname
falsepositives:
- Unknown
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-openssh/win-os-OpenSSH server firewall configuration (PowerShell).yaml
x_legacy_id: winlog-9000-0149
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0149-openssh_server_firewall_configuration_on_windows_powershell.yml
