title: DCOM lateral movement (via MMC20)
id: winlog-0160
status: experimental
rule_origin: public
description: Detects scenarios where an attacker execute the Impacket DCOMexec tool in order to abuse DCOM services.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0008-Lateral%20Movement/T1021.003-Distributed%20Component%20Object%20Model%20(DCOM)
- https://enigma0x3.net/2017/01/23/lateral-movement-via-dcom-round-2/
- https://enigma0x3.net/2017/01/05/lateral-movement-using-the-mmc20-application-com-object/
- https://github.com/SecureAuthCorp/impacket/blob/master/examples/dcomexec.py
- https://www.ired.team/offensive-security/lateral-movement/t1175-distributed-component-object-model
- https://www.synacktiv.com/publications/traces-of-windows-remote-command-execution.html
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0008
- attack.t1021.003
- attack.lateral_movement
logsource:
  product: windows
  category:
  - ps_module
  - ps_script
detection:
  selection_powershell_modern:
    EventID: 4103
    Payload|contains|all:
    - '[System.Activator]'
    - CreateInstance
    - GetTypeFromProgID
    - MMC20.Application
  selection_powershell_block:
    EventID: 4104
    ScriptBlockText|contains|all:
    - '[System.Activator]'
    - CreateInstance
    - GetTypeFromProgID
    - MMC20.Application
  condition: 1 of selection*
fields:
- Hostname
- EventID
- Payload
- ScriptBlockText
unique_fields:
- Hostname
falsepositives:
- none
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-DCOM lateral movement via MMC (PowerShell).yaml
x_legacy_id: winlog-9000-0155
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0155-dcom_lateral_movement_via_mmc20.yml
