title: Impacket DCOMexec process abuse via MMC
id: winlog-0161
status: experimental
rule_origin: public
description: Detects scenarios where an attacker execute the Impacket DCOMexec tool in order to abuse DCOM services.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0008-Lateral%20Movement/T1021.003-Distributed%20Component%20Object%20Model%20(DCOM)
- https://enigma0x3.net/2017/01/23/lateral-movement-via-dcom-round-2/
- https://enigma0x3.net/2017/01/05/lateral-movement-using-the-mmc20-application-com-object/
- https://github.com/SecureAuthCorp/impacket/blob/master/examples/dcomexec.py
- https://www.ired.team/offensive-security/lateral-movement/t1175-distributed-component-object-model
- https://www.synacktiv.com/publications/traces-of-windows-remote-command-execution.html
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0008
- attack.t1021.003
- attack.lateral_movement
logsource:
  product: windows
  category: process_creation
detection:
  selection_basic:
    EventID: 4688
    Version: 2
    ParentProcessName|endswith: \svchost.exe
    NewProcessName|endswith: \mmc.exe
  selection_sysmon:
    EventID: 1
    ParentImage|endswith: \svchost.exe
    Image|endswith: \mmc.exe
  condition: selection_basic or selection_sysmon
fields:
- Hostname
- EventID
- Image
- NewProcessName
- ParentImage
- ParentProcessName
- Version
unique_fields:
- Hostname
falsepositives:
- applications using DCOM components remotely
- rare administrator modifications of DCOM settings
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-DCOMexec abuse via MMC (command).yaml
x_legacy_id: winlog-9000-0156
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0156-impacket_dcomexec_process_abuse_via_mmc.yml
