title: DoT (DNS over TLS) activation (PowerShell)
id: winlog-0163
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to enable DNS over TLS in order to evade detection for command and
  control purposes.
references:
- https://techcommunity.microsoft.com/t5/networking-blog/dns-over-tls-available-to-windows-insiders/ba-p/3565859
- http://woshub.com/enable-dns-over-https-windows/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0005
- attack.t1071.004
- attack.defense_evasion
- attack.command_and_control
logsource:
  product: windows
  category:
  - ps_module
  - ps_script
detection:
  selection_powershell_modern:
    EventID: 4103
    Payload|contains|all:
    - -ItemProperty
    - \SYSTEM\CurrentControlSet\Services\Dnscache\Parameters
    - EnableAutoDoh
  selection_powershell_block:
    EventID: 4104
    ScriptBlockText|contains|all:
    - -ItemProperty
    - \SYSTEM\CurrentControlSet\Services\Dnscache\Parameters
    - EnableAutoDoh
  condition: 1 of selection*
fields:
- Hostname
- EventID
- Payload
- ScriptBlockText
unique_fields:
- Hostname
falsepositives:
- Legitimate DoT activation by administrators
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-DoT (DNS over TLS) activation (Reg via PowerShell).yaml
x_legacy_id: winlog-9000-0158
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0158-dot_dns_over_tls_activation_powershell.yml
