title: Vault credentials manager accessed
id: winlog-0165
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to access vault credentials.
references:
- https://twitter.com/SBousseaden/status/1573380065714470912
- https://sites.utexas.edu/glenmark/2019/10/21/using-passwordvault-with-powershell/
- https://vimalshekar.github.io/scriptsamples/Getting-Stored-Web-Credentials-using-PowerShell
- https://gist.github.com/Samirbous/c3c4122493ea5076adea9c895d2340ea
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1555.004
- attack.credential_access
logsource:
  product: windows
  category:
  - ps_module
  - ps_script
detection:
  selection_powershell_modern:
    EventID: 4103
    Payload|contains|all:
    - Windows.Security.Credentials.PasswordVault
    - Retrieve
  selection_powershell_block:
    EventID: 4104
    ScriptBlockText|contains|all:
    - Windows.Security.Credentials.PasswordVault
    - Retrieve
  condition: 1 of selection*
fields:
- Hostname
- EventID
- Payload
- ScriptBlockText
unique_fields:
- Hostname
falsepositives:
- Unknown
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-Fortinet APT group abuse on Windows (PowerShell).yaml
x_legacy_id: winlog-9000-0160
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0160-vault_credentials_manager_accessed.yml
