title: PSexec application execution
id: winlog-0169
status: experimental
rule_origin: public
description: Detects scenarios where an attacker installs and executes PSexec.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0008-Lateral%20Movement/T1021.002%20-SMB%20Windows%20Admin%20Shares
- https://attack.mitre.org/software/S0029/
- https://pentera.io/blog/135-is-the-new-145/
- https://nv2lt.github.io/windows/smb-psexec-smbexec-winexe-how-to/
- https://www.synacktiv.com/publications/traces-of-windows-remote-command-execution.html
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0002
- attack.t1569.002
- attack.execution
logsource:
  product: windows
  category: process_creation
detection:
  selection_process_child:
    NewProcessName|endswith: \PSEXESVC.exe
  selection_process_parent:
    ParentProcessName|endswith: \PSEXESVC.exe
    Version: 2
  condition: selection_process_child or selection_process_parent
fields:
- Hostname
- NewProcessName
- ParentProcessName
- Version
unique_fields:
- Hostname
falsepositives:
- Administrator activity
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-PSexec installation.yaml
x_legacy_id: winlog-9000-0166
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0166-psexec_application_execution.yml
