title: PSexec execution over SMB share
id: winlog-0170
status: experimental
rule_origin: public
description: Detects scenarios where an attacker execute PSexec on a remote host via SMB
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0008-Lateral%20Movement/T1021.002%20-SMB%20Windows%20Admin%20Shares
- https://attack.mitre.org/software/S0029/
- https://pentera.io/blog/135-is-the-new-145/
- https://nv2lt.github.io/windows/smb-psexec-smbexec-winexe-how-to/
- https://www.synacktiv.com/publications/traces-of-windows-remote-command-execution.html
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0008
- attack.t1021.002
- attack.lateral_movement
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5145
    ShareName:
    - \\*\ADMIN$
    - \\*\IPC$
    RelativeTargetName|contains: PSEXESVC
  filter:
    SubjectUserName: '%admin_account%'
  condition: selection and not filter
fields:
- Hostname
- EventID
- RelativeTargetName
- ShareName
- SubjectUserName
unique_fields:
- Hostname
falsepositives:
- Administrator activity
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-PSexec remote execution via SMB.yaml
x_legacy_id: winlog-9000-0167
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0167-psexec_execution_over_smb_share.yml
