title: PSexec service installation
id: winlog-0171
status: experimental
rule_origin: public
description: Detects scenarios where an attacker installs PSexec service.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1543.003-Create%20or%20Modify%20System%20Process-Windows%20Service
- https://attack.mitre.org/software/S0029/
- https://pentera.io/blog/135-is-the-new-145/
- https://nv2lt.github.io/windows/smb-psexec-smbexec-winexe-how-to/
- https://www.synacktiv.com/publications/traces-of-windows-remote-command-execution.html
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0004
- attack.t1543.003
- attack.privilege_execution
logsource:
  product: windows
  service:
  - system
  - security
detection:
  selection_service_install:
    EventID:
    - 4697
    - 7045
    ServiceName|contains: PSEXESVC
  selection_service_privilege:
    EventID: 4674
    ObjectServer: SC Manager
    ProcessName|endswith: \services.exe
    ObjectName: PSEXESVC
  condition: selection_service_install or selection_service_privilege
fields:
- Hostname
- EventID
- ObjectName
- ObjectServer
- ProcessName
- ServiceName
unique_fields:
- Hostname
falsepositives:
- Administrator activity
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-PSexec service install.yaml
x_legacy_id: winlog-9000-0168
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0168-psexec_service_installation.yml
