title: Mimikatz Pass-the-hash login
id: winlog-0172
status: experimental
rule_origin: public
description: Detects scenarios where an attacker uses the Mimikatz Pass-the-hash feature to move laterally. Correlation with
  others event IDs can be done in the following way:| ID 4624 TargetLogonId + ID 4672 SubjectLogonId + ID 4688 TargetLogonId.
  Having those 3 elements together allows to bring in light what was exactly done.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0008-Lateral%20Movement/T1550-Use%20Alternate%20Authentication%20Material
- https://stealthbits.com/blog/passing-the-hash-with-mimikatz/
- https://s3cur3th1ssh1t.github.io/Named-Pipe-PTH/
- https://thedfirreport.com/2022/11/14/bumblebee-zeros-in-on-meterpreter/
- https://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0008
- attack.t1550.002
- attack.lateral_movement
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4624
    LogonType: 9
    LogonProcessName: seclogo
    AuthenticationPackageName: Negotiate
    ProcessName: C:\Windows\System32\svchost.exe
    IpAddress: ::1
  condition: selection
fields:
- Hostname
- AuthenticationPackageName
- EventID
- IpAddress
- LogonProcessName
- LogonType
- ProcessName
unique_fields:
- Hostname
falsepositives:
- Runas.exe executed with /netonly parameter
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-Pass-the-hash login with Mimikatz.yaml
x_legacy_id: winlog-9000-0169
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0169-mimikatz_pass_the_hash_login.yml
