title: WMI registration (PowerShell)
id: winlog-0178
status: experimental
rule_origin: public
description: Detects scenarios where an attacker createsan instance of a WMI class using tools like WMImplant or PowerLurk.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1546-Event%20Triggered%20Execution
- https://github.com/Sw4mpf0x/PowerLurk
- https://github.com/FortyNorthSecurity/WMImplant
- https://www.netspi.com/blog/technical/adversary-simulation/getting-started-wmi-weaponization-part-5/
- https://www.darkoperator.com/blog/2017/10/14/basics-of-tracking-wmi-activity
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1546.003
- attack.persistence
logsource:
  product: windows
  category:
  - ps_module
  - ps_script
detection:
  selection2_powershell_modern:
    EventID: 4103
    Payload|contains:
    - Class
    - Namespace
    - Arguments
  selection3_powershell_block:
    EventID: 4104
    ScriptBlockText|contains:
    - Class
    - Namespace
    - Arguments
  condition: 1 of selection*
fields:
- Hostname
- EventID
- Payload
- ScriptBlockText
unique_fields:
- Hostname
falsepositives:
- legitimate WMI class registration
- monitoring products
- Microsoft System Center or security products
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-WMI event registration (PowerShell).yaml
x_legacy_id: winlog-9000-0176
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0176-wmi_registration_powershell.yml
