title: Impacket WMIexec process execution
id: winlog-0181
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to execute WMIexec in order to escalate privileges.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0002-Execution/T1047-Windows%20Management%20Instrumentation
- https://riccardoancarani.github.io/2020-05-10-hunting-for-impacket/#wmiexecpy
- https://labs.withsecure.com/publications/attack-detection-fundamentals-discovery-and-lateral-movement-lab-5
- https://github.com/SecureAuthCorp/impacket/blob/master/examples/wmiexec.py
- https://www.darkoperator.com/blog/2017/10/14/basics-of-tracking-wmi-activity
- https://www.crowdstrike.com/blog/how-to-detect-and-prevent-impackets-wmiexec/
- https://www.microsoft.com/en-us/security/blog/2022/10/18/defenders-beware-a-case-for-post-ransomware-investigations/
- https://blog.sekoia.io/lucky-mouse-incident-response-to-detection-engineering/
- https://thedfirreport.com/2023/01/09/unwrapping-ursnifs-gifts/
- https://thedfirreport.com/2023/10/30/netsupport-intrusion-results-in-domain-compromise/
- https://thedfirreport.com/2024/06/10/icedid-brings-screenconnect-and-csharp-streamer-to-alphv-ransomware-deployment
- https://www.security.com/threat-intelligence/us-china-espionage
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0002
- attack.t1047
- attack.execution
logsource:
  product: windows
  category: process_creation
detection:
  selection_baseline:
    Image|endswith: \cmd.exe
  selection_parent:
    ParentCommandLine|contains|all:
    - \\127.0.0.1\
    - /Q
    - /C
  selection_process:
    CommandLine|contains|all:
    - \\127.0.0.1\
    - /Q
    - /C
  condition: selection_baseline and (selection_parent or selection_process)
fields:
- Hostname
- CommandLine
- Image
- ParentCommandLine
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-WMIexec execution (SYSMON).yaml
x_legacy_id: winlog-9000-0180
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0180-impacket_wmiexec_process_execution.yml
