title: Impacket WMIexec execution via SMB admin share
id: winlog-0182
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to remotely execute WMIexec via SMB admin share in order to escalate
  privileges.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0008-Lateral%20Movement/T1021.002%20-SMB%20Windows%20Admin%20Shares
- https://riccardoancarani.github.io/2020-05-10-hunting-for-impacket/#wmiexecpy
- https://www.darkoperator.com/blog/2017/10/14/basics-of-tracking-wmi-activity
- https://www.crowdstrike.com/blog/how-to-detect-and-prevent-impackets-wmiexec/
- https://www.microsoft.com/en-us/security/blog/2022/10/18/defenders-beware-a-case-for-post-ransomware-investigations/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0008
- attack.t1021.002
- attack.lateral_movement
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5145
    ShareName: \\*\ADMIN$
    RelativeTargetName|re: __\d*\.\d*
  condition: selection
fields:
- Hostname
- EventID
- RelativeTargetName
- ShareName
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-WMIexec via SMB admin share.yaml
x_legacy_id: winlog-9000-0181
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0181-impacket_wmiexec_execution_via_smb_admin_share.yml
