title: Wdigest authentication enabled (Reg via command)
id: winlog-0183
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to enable Wdgiest authention so passwords are stored in clear text
  and can be dumped.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/
- https://thedfirreport.com/2021/08/16/trickbot-leads-up-to-fake-1password-installation/
- https://www.ired.team/offensive-security/credential-access-and-credential-dumping/forcing-wdigest-to-store-credentials-in-plaintext
- https://www.hackingarticles.in/credential-dumping-wdigest/
- https://stealthbits.com/blog/wdigest-clear-text-passwords-stealing-more-than-a-hash/
- https://github.com/HarmJ0y/Misc-PowerShell/blob/master/Invoke-WdigestDowngrade.ps1
- https://www.microsoft.com/en-us/security/blog/2022/10/18/defenders-beware-a-case-for-post-ransomware-investigations/
- https://www.sentinelone.com/blog/how-attackers-exploit-security-support-provider-ssp-for-credential-dumping/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1003
- attack.t1562
- attack.credential_access
- attack.defense_evasion
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    NewProcessName|endswith: \reg.exe
    CommandLine|contains|all:
    - REG ADD
    - \SYSTEM\CurrentControlSet\Control\SecurityProviders\WDigest
    - UseLogonCredential
  condition: selection
fields:
- Hostname
- CommandLine
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-Wdigest (SSP) authentication activated (Reg via command).yaml
x_legacy_id: winlog-9000-0182
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0182-wdigest_authentication_enabled_reg_via_command.yml
