title: Audit policy enumerated
id: winlog-0186
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts enumerate the audit policy in place.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1070.xxx-Audit%20policy%20disabled
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/auditpol-get
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0007
- attack.t1082
- attack.discovery
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    NewProcessName|endswith: \auditpol.exe
    CommandLine|contains:
    - get
    - backup
  condition: selection
fields:
- Hostname
- CommandLine
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- Administrator debugging audit policy
- Vulnerability scanners (compiance module)
- Directory monitor
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-audit policy enumeration (command).yaml
x_legacy_id: winlog-9000-0186
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0186-audit_policy_enumerated.yml
