title: VSS backup deletion or resize
id: winlog-0189
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to delete or resize existing VSS backup.
references:
- https://www.picussecurity.com/resource/blog/how-to-beat-nefilim-ransomware-attacks
- https://www.itechtics.com/volume-shadow-copies/
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin
- https://www.picussecurity.com/resource/blog/technique-to-delete-volume-shadow-copies-deviceiocontrol
- https://thedfirreport.com/2021/12/13/diavol-ransomware/
- https://www.mandiant.com/resources/chasing-avaddon-ransomware
- https://blogs.vmware.com/security/2022/09/threat-report-illuminating-volume-shadow-deletion.html
- https://fourcore.io/blogs/ryuk-ransomware-simulation-mitre-ttp
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0040
- attack.t1490
- attack.impact
logsource:
  product: windows
  category: process_creation
detection:
  selection_baseline:
    EventID: 4688
    NewProcessName|endswith: \vssadmin.exe
  selection_delete:
    CommandLine|contains|all:
    - shadows
    - delete
  selection_resize:
    CommandLine|contains|all:
    - resize
    - shadowstorage
  condition: selection_baseline and (selection_delete or selection_resize)
fields:
- Hostname
- CommandLine
- EventID
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- administrator cleaning outdated backup
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-backup VSS deletion or resize (command).yaml
x_legacy_id: winlog-9000-0189
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0189-vss_backup_deletion_or_resize.yml
