title: Windows native backup size re-configuration
id: winlog-0191
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to delete existing Windows native backup by reducing the allocated
  backup storage.
references:
- https://www.picussecurity.com/resource/blog/how-to-beat-nefilim-ransomware-attacks
- https://www.itechtics.com/volume-shadow-copies/
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin
- https://www.picussecurity.com/resource/blog/technique-to-delete-volume-shadow-copies-deviceiocontrol
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0040
- attack.t1490
- attack.impact
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith: \Windows\System32\vssadmin.exe
    CommandLine|contains|all:
    - resize
    - shadowstorage
  condition: selection
fields:
- Hostname
- CommandLine
- EventID
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- administrator cleaning outdated backup
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-backup Windows native size reconfiguration.yaml
x_legacy_id: winlog-9000-0191
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0191-windows_native_backup_size_re_configuration.yml
