title: Brutforce enumeration with non existing users (login)
id: winlog-0193
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to enumerate potential existing users, resulting in failed logins
  with unexisting or invalid accounts.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1110.xxx-Brut%20force
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4625
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1110
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4625
    SubStatus: '0xc0000064'
  filter:
    IpAddress: '%domain_controllers_ips%'
  condition: selection and not filter
fields:
- Hostname
- EventID
- IpAddress
- SubStatus
- TargetUserName
unique_fields:
- Hostname
falsepositives:
- Missconfigured application
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-brutforce enumeration with unexisting users.yaml
x_legacy_id: winlog-9000-0193
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0193-brutforce_enumeration_with_non_existing_users_login.yml
