title: Certutil payload obfuscation - Tchopper (command)
id: winlog-0196
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to abuse certutil command to download obfuscated malicious payload
  using the Tchopper tool.
references:
- https://github.com/lawrenceamer/TChopper
- https://www.elastic.co/guide/en/security/current/suspicious-certutil-commands.html
- https://www.bleepingcomputer.com/news/security/certutilexe-could-allow-attackers-to-download-malware-while-bypassing-av/
- https://attack.mitre.org/software/S0160/
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
- https://www.sentinelone.com/blog/malware-living-off-land-with-certutil/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0005
- attack.t1140
- attack.defense_evasion
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    EventID: 4688
    Version: 2
    ParentProcessName|endswith: \WmiPrvSE.exe
    NewProcessName|endswith: \certutil.exe
    CommandLine|contains: decode
  condition: selection
fields:
- Hostname
- CommandLine
- EventID
- NewProcessName
- ParentProcessName
- Version
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-certutil obfuscation - Tchopper.yaml
x_legacy_id: winlog-9000-0196
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0196-certutil_payload_obfuscation_tchopper_command.yml
