title: Credentials (protected by DPAPI) dump via network share
id: winlog-0199
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempt to dump DPAPI credentials (Windows Vault, Chrome, RDP, WiFi, Emails,
  ...) or registry hives via network share via tools like DonPAPI.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/EVTX_full_APT_attack_steps
- https://github.com/login-securite/DonPAPI
- https://hackinparis.com/data/slides/2019/talks/HIP2019-Paula_Januszkiewicz-Dpapi_And_Dpapi_Ng_Decrypting_All_Users_Secrets_And_Pfx_Passwords.pdf
- https://www.thehacker.recipes/ad/movement/credentials/dumping/dpapi-protected-secrets
- https://hunter2.gitbook.io/darthsidious/privilege-escalation/mimikatz
- https://book.hacktricks.xyz/windows/windows-local-privilege-escalation/dpapi-extracting-passwords
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1555.004
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5145
    ShareName: \\*\C$
    RelativeTargetName|contains:
    - \ProgramData\Microsoft\Wlansvc\Profiles\Interfaces\
    - \Windows\System32\config\SECURITY
    - \Windows\System32\config\SOFTWARE
    - \Windows\System32\config\SYSTEM
    - \AppData\Local\Microsoft\Vault\
    - \ProgramData\Microsoft\Vault\
    - \Windows\system32\config\systemprofile\AppData\Local\Microsoft\Vault\
    - \AppData\Local\Microsoft\Credentials\
    - \AppData\Roaming\Microsoft\Credentials\
    - \Windows\System32\config\systemprofile\AppData\Local\Microsoft\Credentials\
    - \AppData\Roaming\Microsoft\Protect\
    - \Windows\System32\Microsoft\Protect\
  condition: selection
fields:
- Hostname
- EventID
- RelativeTargetName
- ShareName
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-dump credentials (protected with DPAPI) via network share.yaml
x_legacy_id: winlog-9000-0200
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0200-credentials_protected_by_dpapi_dump_via_network_share.yml
