title: Event log clear attempt (PowerShell)
id: winlog-0202
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to clear the event logs.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1070.001-Clear%20Windows%20event%20logs
- https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.management/clear-eventlog?view=powershell-5.1
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0005
- attack.t1070.001
- attack.defense_evasion
logsource:
  product: windows
  category:
  - ps_module
  - ps_script
detection:
  selection_powershell_modern:
    EventID: 4103
    Payload|contains|all:
    - Clear-EventLog
    - LogName
  selection_powershell_block:
    EventID: 4104
    ScriptBlockText|contains|all:
    - Clear-EventLog
    - LogName
  condition: selection_powershell_modern or selection_powershell_block
fields:
- Hostname
- EventID
- Payload
- ScriptBlockText
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-event log clear attempt (PowerShell).yaml
x_legacy_id: winlog-9000-0203
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0203-event_log_clear_attempt_powershell.yml
