title: Group discovery (PowerShell)
id: winlog-0208
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to enumerate local or domain groups via PowerShell.
references:
- https://blogs.jpcert.or.jp/en/2016/01/windows-commands-abused-by-attackers.html
- https://github.com/swisskyrepo/PayloadsAllTheThings/blob/master/Methodology%20and%20Resources/Windows%20-%20Privilege%20Escalation.md
- https://docs.microsoft.com/en-us/powershell/module/activedirectory/get-adgroup?view=windowsserver2019-ps
- https://adamtheautomator.com/get-adgroupmember/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0007
- attack.t1069.001
- attack.t1069.002
- attack.discovery
logsource:
  product: windows
  category:
  - ps_module
  - ps_script
detection:
  selection_powershell_modern:
    EventID: 4103
    Payload|contains|all:
    - Get-LocalGroupMember
    - Get-ADGroupMember
  selection_powershell_block:
    EventID: 4104
    ScriptBlockText|contains|all:
    - Get-LocalGroupMember
    - Get-ADGroupMember
  condition: 1 of selection*
fields:
- Hostname
- EventID
- Payload
- ScriptBlockText
- EventRecordID
unique_fields:
- Hostname
falsepositives:
- Pentest
- Administrator activity
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-group discovery (PowerShell).yaml
x_legacy_id: winlog-9000-0209
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0209-group_discovery_powershell.yml
