title: Group discovery (command)
id: winlog-0209
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to enumerate local or domain groups via commandline.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0007-Discovery/T1069-Permission%20Groups%20Discovery
- https://blogs.jpcert.or.jp/en/2016/01/windows-commands-abused-by-attackers.html
- https://github.com/swisskyrepo/PayloadsAllTheThings/blob/master/Methodology%20and%20Resources/Windows%20-%20Privilege%20Escalation.md
- https://attack.mitre.org/software/S0039/
- https://regex101.com/r/S6vTNM/1
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0007
- attack.t1069.001
- attack.t1069.002
- attack.t1087.002
- attack.discovery
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    NewProcessName|endswith:
    - \net.exe
    - \net1.exe
    CommandLine|contains:
    - group
    - localgroup
  filter:
    CommandLine|contains: add
  condition: selection and not filter
fields:
- Hostname
- CommandLine
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- Pentest
- Administrator activity
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-group discovery (command).yaml
x_legacy_id: winlog-9000-0210
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0210-group_discovery_command.yml
