title: User added to a group via commandline
id: winlog-0212
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to escalate privilege by adding a user to a group via commandline.
references:
- https://blogs.jpcert.or.jp/en/2016/01/windows-commands-abused-by-attackers.html
- https://attack.mitre.org/software/S0039/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1098
- attack.persistence
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    NewProcessName|endswith:
    - \net1.exe
    - \net.exe
    CommandLine|contains: add
  condition: selection
fields:
- Hostname
- CommandLine
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- Pentest
- Administrator activity
- Splunk UF agent installation
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-group membership change (command).yaml
x_legacy_id: winlog-9000-0213
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0213-user_added_to_a_group_via_commandline.yml
