title: Hidden account creation (with fast deletion)
id: winlog-0214
status: experimental
rule_origin: public
description: Detects scenarios where an attacker creates a hidden local account. See also rule "User account creation disguised
  in a computer account".
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1136-Create%20account
- https://github.com/wgpsec/CreateHiddenAccount
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1098
- attack.t1136
- attack.t0136
- attack.persistence
- attack.defense_evesion
logsource:
  product: windows
  service: security
detection:
  selection_create:
    EventID: 4720
  selection_delete:
    EventID: 4726
  filter:
    Hostname: '%domain_controllers%'
  condition: selection_create and not filter
  timeframe: 1m
fields:
- Hostname
- EventID
unique_fields:
- Hostname
falsepositives:
- IAM account lifecycle software
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-hidden account creation.yaml
x_legacy_id: winlog-9000-0215
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0215-hidden_account_creation_with_fast_deletion.yml
