title: DNS hosts file accessed via network share
id: winlog-0215
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempt read the Hosts file content via network share.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0007-Discovery/T1018-Remote%20System%20Discovery
- https://www.picussecurity.com/resource/blog/how-to-beat-nefilim-ransomware-attacks
- https://github.com/login-securite/DonPAPI
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0007
- attack.t1018
- attack.discovery
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5145
    ShareName: \\*\C$
    RelativeTargetName: Windows\System32\Drivers\etc\hosts
  condition: selection
fields:
- Hostname
- EventID
- RelativeTargetName
- ShareName
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-hosts file accessed via network share.yaml
x_legacy_id: winlog-9000-0216
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0216-dns_hosts_file_accessed_via_network_share.yml
