title: Secretdump password dumping via SMB admin share
id: winlog-0217
status: experimental
rule_origin: public
description: Detects scenarios where an attacker execute Secretdump in order to remotely dump credentials over SMB.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
- https://riccardoancarani.github.io/2020-05-10-hunting-for-impacket/
- https://airman604.medium.com/dumping-active-directory-password-hashes-deb9468d1633
- https://medium.com/@benichmt1/secretsdump-demystified-bfd0f933dd9b
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1003.002
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5145
    ShareName: \\*\ADMIN$
    RelativeTargetName|startswith: SYSTEM32
    RelativeTargetName|endswith: .tmp
  condition: selection
fields:
- Hostname
- EventID
- RelativeTargetName
- ShareName
unique_fields:
- Hostname
falsepositives:
- none
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-impacket secret dump via SMB admin share.yaml
x_legacy_id: winlog-9000-0218
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0218-secretdump_password_dumping_via_smb_admin_share.yml
