title: Netsh helper DLL abuse (process)
id: winlog-0226
status: experimental
rule_origin: public
description: Detects scenarios where an attacker abuses the Netsh DLL feature to perform some code execution.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1546-Event%20Triggered%20Execution
- https://www.hackingarticles.in/windows-persistence-using-netsh/
- https://liberty-shell.com/sec/2018/07/28/netshlep/
- https://github.com/outflanknl/NetshHelperBeacon
- https://www.ired.team/offensive-security/persistence/t1128-netsh-helper-dll
- https://lolbas-project.github.io/lolbas/Binaries/Netsh/
- https://pentestlab.blog/2019/10/29/persistence-netsh-helper-dll/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1546.007
- attack.persistence
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith: \netsh.exe
    Commandline|contains|all:
    - netsh
    - add
    - helper
  condition: selection
fields:
- Hostname
- Commandline
- EventID
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- Administrator activity
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-netsh helper DLL registration abuse (command).yaml
x_legacy_id: winlog-9000-0228
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0228-netsh_helper_dll_abuse_process.yml
