title: New rights granted to an account for privilege escalation
id: winlog-0227
status: experimental
rule_origin: public
description: Detects scenarios where an attacker grants new rights to an account in order to escalate privileges
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0004-Privilege%20Escalation/T1134-Access%20Token%20Manipulation
- https://medium.com/palantir/windows-privilege-abuse-auditing-detection-and-defense-3078a403d74e
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4717
- https://docs.microsoft.com/en-us/windows/security/threat-protection/security-policy-settings/user-rights-assignment
- https://medium.com/falconforce/falconfriday-detecting-lsass-dumping-with-debug-privileges-0xff1f-328fdb78f5be
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0004
- attack.t1134
- attack.privilege_escalation
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
    - 4717
    - 4704
  filter:
    SubjectUserName|endswith: $
  condition: selection and not filter
fields:
- Hostname
- EventID
- SubjectUserName
unique_fields:
- Hostname
falsepositives:
- Specific account configuration
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-new rights granted to an account.yaml
x_legacy_id: winlog-9000-0230
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0230-new_rights_granted_to_an_account_for_privilege_escalation.yml
