title: Password policy discovery via commandline
id: winlog-0228
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to enumerate the password policy via commandline.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0007-Discovery/T1201-Password%20Policy%20Discovery
- https://blogs.jpcert.or.jp/en/2016/01/windows-commands-abused-by-attackers.html
- https://attack.mitre.org/software/S0039/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0007
- attack.t1201
- attack.discovery
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    NewProcessName|endswith:
    - \net1.exe
    - \net.exe
    CommandLine|contains|all:
    - accounts
    - /do
  condition: selection
fields:
- Hostname
- CommandLine
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- Pentest
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-password policy discovery (command).yaml
x_legacy_id: winlog-9000-0231
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0231-password_policy_discovery_via_commandline.yml
