title: Payload downloaded via PowerShell
id: winlog-0229
status: experimental
rule_origin: public
description: Detects scenarios where an attacker download a payload using PowerShell.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0002-Execution/T1059.001-PowerShell
- https://thedfirreport.com/2021/08/16/trickbot-leads-up-to-fake-1password-installation/
- https://book.hacktricks.xyz/windows/basic-powershell-for-pentesters
- https://www.esentire.com/blog/esentire-threat-intelligence-malware-analysis-resident-campaign
- https://unit42.paloaltonetworks.com/mallox-ransomware/
- https://thedfirreport.com/2023/08/28/html-smuggling-leads-to-domain-wide-ransomware/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0002
- attack.t1059.001
- attack.t1105
- attack.execution
- attack.command_and_control
logsource:
  product: windows
  category:
  - ps_module
  - ps_script
detection:
  selection_powershell_modern:
    EventID: 4103
    Payload|contains:
    - http://
    - https://
    - ftp://
  selection_powershell_block:
    EventID: 4104
    ScriptBlockText|contains:
    - http://
    - https://
    - ftp://
  condition: selection_powershell_modern or selection_powershell_block
fields:
- Hostname
- EventID
- Payload
- ScriptBlockText
unique_fields:
- Hostname
falsepositives:
- Scripts donwloading files
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-payload download (PowerShell).yaml
x_legacy_id: winlog-9000-0232
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0232-payload_downloaded_via_powershell.yml
