title: Discovery for print spooler bug abuse (NTLM hash retrivial) via named pipe
id: winlog-0234
status: experimental
rule_origin: public
description: Detects scenarios where an attacker with a responder in place initiates an authenticated callback request from
  a targeted host with the print spooler service enabled (RpcRemoteFindFirstPrinterChangeNotification abuse). In case the
  targeted host answers to the responder, the NTLM hash of the computer account will be disclosed. Following that, the hash
  can be used for different type of abuse like Silver ticket generation or unconstrained delegation abuse. The rule is designed
  to detect the following scripts > printerbug.py, dementor.py, SpoolSample.exe and Get-SpoolStatus.ps1.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1557-Man%20in%20the%20middle
- https://github.com/dirkjanm/krbrelayx/blob/master/printerbug.py
- https://github.com/NotMedic/NetNTLMtoSilverTicket?s=09
- https://github.com/leechristensen/SpoolSample/
- https://github.com/vletoux/SpoolerScanner
- https://posts.specterops.io/hunting-in-active-directory-unconstrained-delegation-forests-trusts-71f2b33688e1
- https://book.hacktricks.xyz/windows/active-directory-methodology/printers-spooler-service-abuse
- https://stealthbits.com/blog/impersonating-service-accounts-with-silver-tickets/
- https://blog.cymulate.com/compromising-a-domain
- https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rprn/b8b414d9-f1cd-4191-bb6b-87d09ab2fd83
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1557.001
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5145
    ShareName: \\*\IPC$
    RelativeTargetName: spoolss
    AccessMask:
    - 3
    - 1180063
  condition: selection
fields:
- Hostname
- AccessMask
- EventID
- RelativeTargetName
- ShareName
- IpAddress
unique_fields:
- IpAddress
falsepositives:
- vulnerability scanners
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-print spooler bug discovery via named pipe.yaml
x_legacy_id: winlog-9000-0237
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0237-discovery_for_print_spooler_bug_abuse_ntlm_hash_retrivial_via_named_pipe.yml
