title: Privilege escalation via RunasCS
id: winlog-0238
status: experimental
rule_origin: public
description: Detects scenarios where attack attempts to elevate privileges via customize Runas tool.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0004-Privilege%20Escalation/T1134-Access%20Token%20Manipulation
- https://github.com/antonioCoco/RunasCs
- https://twitter.com/SBousseaden/status/1478373779642400783
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0004
- attack.t1134.002
- attack.privilege_escalation
logsource:
  product: windows
  category: process_creation
detection:
  selection_process:
    EventID: 4688
    TargetUserSid: S-1-0-0
  filter_user_process:
  - TargetUserName:
    - LOCAL SERVICE
    - Network Service
    - DWM-*
    - UMFD-*
    - sshd_*
    - '*$'
    - DefaultAppPool
    - '-'
  - TargetDomainName:
    - NT Service
    - NT AUTHORITY
    - Font Driver Host
    - Window Manager
    - IIS APPPOOL
    - VIRTUAL USERS
  condition: selection_process and not filter_user_process
fields:
- Hostname
- EventID
- TargetDomainName
- TargetUserName
- TargetUserSid
unique_fields:
- Hostname
falsepositives:
- Administrator activity
level: low
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-privilege escalation via RunasCS.yaml
x_legacy_id: winlog-9000-0242
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0242-privilege_escalation_via_runascs.yml
