title: Privilege escalation via runas (command)
id: winlog-0239
status: experimental
rule_origin: public
description: Detects scenarios where attack attempts to elevate privileges via the command runas.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0004-Privilege%20Escalation/T1134-Access%20Token%20Manipulation
- https://www.elastic.co/fr/blog/how-attackers-abuse-access-token-manipulation
- http://www.pseale.com/pretend-youre-on-the-domain-with-runas-netonly
- https://blog.palantir.com/windows-privilege-abuse-auditing-detection-and-defense-3078a403d74e
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0004
- attack.t1134.002
- attack.privilege_escalation
logsource:
  product: windows
  service: security
detection:
  selection_command:
    EventID: 4688
    NewProcessName|endswith: \runas.exe
    CommandLine|contains|all:
    - runas
    - '/user:'
  selection_login:
    EventID: 4624
    LogonType: 2
    LogonProcessName: seclogo
    ProcessName|endswith: \svchost.exe
    IpAddress: ::1
  selection_swtich_cred:
    EventID: 4648
    TargetServerName: localhost
    ProcessName|endswith: \svchost.exe
    IpAddress: '::1 '
  condition: selection_login
fields:
- Hostname
- CommandLine
- EventID
- IpAddress
- LogonProcessName
- LogonType
- NewProcessName
- ProcessName
- TargetServerName
unique_fields:
- Hostname
falsepositives:
- Administrator activity
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-privilege escalation via runas (command).yaml
x_legacy_id: winlog-9000-0243
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0243-privilege_escalation_via_runas_command.yml
