title: Massive processes termination burst
id: winlog-0241
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to kill multiples services on a host. Attacker may target services
  related to databases, security products or backups (Veeam, Symantec, Acronis ...).
references:
- https://www.microsoft.com/security/blog/2020/03/05/human-operated-ransomware-attacks-a-preventable-disaster/
- https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
- https://research.nccgroup.com/2022/08/19/back-in-black-unlocking-a-lockbit-3-0-ransomware-attack/
- http://woshub.com/killing-windows-services-that-hang-on-stopping/
- https://fourcore.io/blogs/ryuk-ransomware-simulation-mitre-ttp
- https://www.trendmicro.com/en_us/research/22/e/avoslocker-ransomware-variant-abuses-driver-file-to-disable-anti-Virus-scans-log4shell.html
- https://unit42.paloaltonetworks.com/mallox-ransomware/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0040
- attack.t1489
- attack.impact
- attack.defense_evasion
- attack.1562.001
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    NewProcessName|endswith: \taskkill.exe
    CommandLine|contains:
    - /f
    - -f
  condition: selection
  timeframe: 1m
fields:
- Hostname
- CommandLine
- NewProcessName
- EventRecordID
unique_fields:
- Hostname
falsepositives:
- Administrator debugging
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-process termination-kill burst.yaml
x_legacy_id: winlog-9000-0245
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0245-massive_processes_termination_burst.yml
