title: Remote shell execution via SMB admin share
id: winlog-0243
status: experimental
rule_origin: public
description: Detects scenarios where an attacker execute a remote shell via the admin share.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0008-Lateral%20Movement/T1021.002%20-SMB%20Windows%20Admin%20Shares
- https://www.offensive-security.com/metasploit-unleashed/psexec-pass-hash/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0008
- attack.t1021.002
- attack.lateral_movement
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5145
    ShareName: \\*\ADMIN$
    RelativeTargetName|endswith:
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
  condition: selection
fields:
- Hostname
- EventID
- RelativeTargetName
- ShareName
unique_fields:
- Hostname
falsepositives:
- Administrator activity
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-remote shell execution via SMB admin share.yaml
x_legacy_id: winlog-9000-0247
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0247-remote_shell_execution_via_smb_admin_share.yml
