title: Security package (SSP) loaded into LSA (native)
id: winlog-0245
status: experimental
rule_origin: public
description: Detects scenarios where an attacker loads a malicious SSP (Security Support Provider) into the LSA process. Note
  that this rule will not work with "in memory" SSP injection (Mimikatz) as no event will be triggered.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1547-Boot%20or%20Logon%20Autostart%20Execution
- https://twitter.com/JohnLaTwC/status/1417106953881497602?s=09
- https://blog.xpnsec.com/exploring-mimikatz-part-2/
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4622
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-R2-and-2012/dn408187(v=ws.11)?redirectedfrom=MSDN
- https://pentestlab.blog/2019/10/21/persistence-security-support-provider/
- https://www.ired.team/offensive-security/credential-access-and-credential-dumping/intercepting-logon-credentials-via-custom-security-support-provider-and-authentication-package
- https://securityintelligence.com/posts/hunting-evidence-dll-side-loading-powershell-sysmon/
- https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16
- https://github.com/S1ckB0y1337/Active-Directory-Exploitation-Cheat-Sheet#custom-ssp
- https://www.sentinelone.com/blog/how-attackers-exploit-security-support-provider-ssp-for-credential-dumping/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1547.008
- attack.persistence
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4622
  filter:
    SecurityPackageName|contains:
    - \Windows\system32\cloudAP.dll
    - \Windows\system32\kerberos.dll
    - \Windows\system32\lsasrv.dll
    - \Windows\system32\msv1_0.dll
    - \Windows\system32\negoexts.dll
    - \Windows\system32\pku2u.dll
    - \Windows\system32\schannel.dll
    - \Windows\system32\tspkg.dll
    - \Windows\system32\wdigest.dll
  condition: selection and not filter
fields:
- Hostname
- EventID
- SecurityPackageName
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-security package (SSP) loaded into LSA (native).yaml
x_legacy_id: winlog-9000-0250
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0250-security_package_ssp_loaded_into_lsa_native.yml
