title: SMB admin share accessed
id: winlog-0247
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to connect to the administrative SMB share.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0008-Lateral%20Movement/T1021.002%20-SMB%20Windows%20Admin%20Shares
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0008
- attack.t1021.002
- attack.lateral_movement
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
    - 5140
    - 5145
    ShareName: \\*\ADMIN$
  filter:
  - RelativeTargetName|endswith:
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
  - IpAddress:
    - '%vulnerability_scanners%'
    - '%admin_netork_administration%'
  condition: selection and not filter
fields:
- Hostname
- EventID
- IpAddress
- RelativeTargetName
- ShareName
unique_fields:
- Hostname
falsepositives:
- Administrator activity, backup solutions
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-share admin$ accessed via SMB.yaml
x_legacy_id: winlog-9000-0252
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0252-smb_admin_share_accessed.yml
