title: Network share manipulation via commandline
id: winlog-0249
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to enumerate or to establish a connection to a network share.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0008-Lateral%20Movement/T1021.002%20-SMB%20Windows%20Admin%20Shares
- https://blogs.jpcert.or.jp/en/2016/01/windows-commands-abused-by-attackers.html
- https://attack.mitre.org/software/S0039/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0008
- attack.t1021.002
- attack.lateral_movement
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith:
    - \net1.exe
    - \net.exe
    CommandLine|contains: share
  condition: selection
fields:
- Hostname
- CommandLine
- EventID
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- Pentest
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-share manipulation (command).yaml
x_legacy_id: winlog-9000-0254
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0254-network_share_manipulation_via_commandline.yml
