title: CrackMaxpExec share permission enumeration
id: winlog-0252
status: experimental
rule_origin: public
description: Detects scenarios where an attacker would perform share permission enumeration using CrackMaxExec SMBmodule.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1222.001-File%20and%20Directory%20Permissions%20Modification
- https://hideandsec.sh/books/cheatsheets/page/crackmapexec
- https://www.infosecmatter.com/crackmapexec-module-library/
- https://mpgn.gitbook.io/crackmapexec/smb-protocol/enumeration/enumerate-shares-and-access
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0000
logsource:
  product: windows
  service: security
detection:
  selection_baseline:
    EventID: 5145
  selection_pipes:
    ShareName: \\*\IPC$
    RelativeTargetName:
    - srvsvc
    - svcctl
  selection_admin_share:
    ShareName: \\*\ADMIN$
    RelativeTargetName: ''
  filter:
    IpAddress: '%administration_hosts%'
  condition: selection_baseline and not filter and (selection_pipes or selection_admin_share)
  timeframe: 15m
fields:
- Hostname
- EventID
- IpAddress
- RelativeTargetName
- ShareName
unique_fields:
- IpAddress
falsepositives:
- Administrator activity, backup solutions, Windows Server Manager
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-share permission enumeration (CME).yaml
x_legacy_id: winlog-9000-0257
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0257-crackmaxpexec_share_permission_enumeration.yml
