title: Windows traffic capture abuse
id: winlog-0254
status: experimental
rule_origin: public
description: Detects scenarios where an attacker use the native Windows sniffer in order to capture sensitive information
  or credentials.
references:
- https://bakerstreetforensics.com/2022/01/07/quickpcap-capturing-a-pcap-with-powershell/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1040
- attack.credential_access
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    NewProcessName|endswith: \netsh.exe
    CommandLine|contains|all:
    - netsh
    - start
    - capture
  condition: selection
fields:
- Hostname
- CommandLine
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- Administrator network troubleshooting
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-sniffer native abuse (command).yaml
x_legacy_id: winlog-9000-0259
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0259-windows_traffic_capture_abuse.yml
