title: Stickey key called CMD via command execution (hash detection)
id: winlog-0255
status: experimental
rule_origin: public
description: Detects scenarios where an attacker calls the stickey key and execute CMD.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0004-Privilege%20Escalation/T1546-Image%20File%20Execution%20Options%20Injection
- https://blogs.technet.microsoft.com/jonathantrull/2016/10/03/detecting-sticky-key-backdoors/
- https://www.mandiant.com/resources/apt29-domain-frontin
- https://www.clearskysec.com/wp-content/uploads/2020/02/ClearSky-Fox-Kitten-Campaign-v1.pdf
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0004
- attack.t1546.008
- attack.privilege_escalation
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    EventID: 1
    ParentImage|endswith: \winlogon.exe
    Hashes|contains:
    - 99AE9C73E9BEE6F9C76D6F4093A9882DF06832CF
    - 8C5437CD76A89EC983E3B364E219944DA3DAB464
    - 8DCA9749CD48D286950E7A9FA1088C937CBCCAD4
    - F1EFB0FDDC156E4C61C5F78A54700E4E7984D55D
  condition: selection
fields:
- Hostname
- EventID
- Hashes
- ParentImage
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-sticky key CMD execution (hash detection).yaml
x_legacy_id: winlog-9000-0260
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0260-stickey_key_called_cmd_via_command_execution_hash_detection.yml
