title: Stickey key called CMD via command execution
id: winlog-0256
status: experimental
rule_origin: public
description: Detects scenarios where an attacker calls the stickey key and execute CMD.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0004-Privilege%20Escalation/T1546-Image%20File%20Execution%20Options%20Injection
- https://blogs.technet.microsoft.com/jonathantrull/2016/10/03/detecting-sticky-key-backdoors/
- https://www.mandiant.com/resources/apt29-domain-frontin
- https://www.clearskysec.com/wp-content/uploads/2020/02/ClearSky-Fox-Kitten-Campaign-v1.pdf
- https://blog.talosintelligence.com/2022/08/recent-cyber-attack.html?m=1
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0004
- attack.t1546.008
- attack.privilege_escalation
logsource:
  product: windows
  category: process_creation
detection:
  selection_process:
    EventID: 4688
    Version: 2
    ParentProcessName|endswith: \winlogon.exe
  selection_sysmon:
    EventID: 1
    ParentImage|endswith: \winlogon.exe
  selection_command_line:
    CommandLine|contains:
    - sethc.exe
    - utilman.exe
    - osk.exe
    - Magnify.exe
    - Narrator.exe
    - DisplaySwitch.exe
  condition: (selection_process or selection_sysmon) and selection_command_line
fields:
- Hostname
- CommandLine
- EventID
- ParentImage
- ParentProcessName
- Version
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-sticky key CMD execution.yaml
x_legacy_id: winlog-9000-0261
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0261-stickey_key_called_cmd_via_command_execution.yml
