title: User application credentials dump via network share (DonPapi, Lazagne)
id: winlog-0262
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempt to dump application credentials (Firefox, VNC, Google Chrome, ...)
  via network share.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1555-Credentials%20from%20Password%20Stores
- https://github.com/login-securite/DonPAPI
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1555
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection_event:
    EventID: 5145
    ShareName: \\*\C$
  selection_VNC:
    RelativeTargetName:
    - Program Files (x86)\UltraVNC\ultravnc.ini
    - Program Files (x86)\uvnc bvba\UltraVNC\ultravnc.ini
    - ProgramFiles(x86)\UltraVNC\ultravnc.ini
    - ProgramFiles(x86)\uvnc bvba\UltraVNC\ultravnc.ini
    - PROGRAMFILES\UltraVNC\ultravnc.ini
    - PROGRAMFILES\uvnc bvba\UltraVNC\ultravnc.ini
    - PROGRAM FILES\UltraVNC\ultravnc.ini
    - PROGRAM FILES\uvnc bvba\UltraVNC\ultravnc.ini
  selection_application_credentials:
  - RelativeTargetName|endswith:
    - \AppData\Roaming\8pecxstudios\Cyberfox\profiles.ini
    - \AppData\Roaming\Comodo\IceDragon\profiles.ini
    - \AppData\Roaming\K-Meleon\profiles.ini
    - \AppData\Roaming\NETGATE Technologies\BlackHawk\profiles.ini
  - RelativeTargetName|contains:
    - \AppData\Local\mRemoteNG\
    - \AppData\Roaming\mRemoteNG\
  condition: selection_event and (selection_VNC OR selection_application_credentials)
fields:
- Hostname
- EventID
- RelativeTargetName
- ShareName
unique_fields:
- Hostname
falsepositives:
- Roaming user profile, vulnerability scanners
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-user application credentials dump via share (DonPapi, Lazagne).yaml
x_legacy_id: winlog-9000-0269
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0269-user_application_credentials_dump_via_network_share_donpapi_lazagne.yml
