title: User creation via commandline
id: winlog-0263
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to create a user via commandline.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1136-Create%20account
- https://blogs.jpcert.or.jp/en/2016/01/windows-commands-abused-by-attackers.html
- https://thedfirreport.com/2021/11/15/exchange-exploit-leads-to-domain-wide-ransomware/
- https://attack.mitre.org/software/S0039/
- https://regex101.com/r/S6vTNM/1
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1136.001
- attack.t1136.002
- attack.persistence
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    NewProcessName|endswith:
    - \net1.exe
    - \net.exe
    CommandLine|contains|all:
    - net
    - user
    - add
  condition: selection
fields:
- Hostname
- CommandLine
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- Pentest
- Administrator activity
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-user creation (command).yaml
x_legacy_id: winlog-9000-0270
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0270-user_creation_via_commandline.yml
