title: User enumeration and creation related to Manic Menagerie 2.0 (via cmdline)
id: winlog-0264
status: experimental
rule_origin: public
description: Detects user enumeration and/or creation performed by Manic Menagerie.
references:
- https://unit42.paloaltonetworks.com/manic-menagerie-targets-web-hosting-and-it/
- https://www.cyber.gov.au/sites/default/files/2023-03/report_manic_menagerie.pdf
- https://csl.com.co/rid-hijacking/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1136.001
- attack.persistence
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith:
    - \net1.exe
    - \net.exe
    CommandLine|contains:
    - iis_uses
    - iis_user
  condition: selection
fields:
- Hostname
- CommandLine
- Image
unique_fields:
- Hostname
falsepositives:
- Administrator activity
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-user creation related to Manic Menagerie (command).yaml
x_legacy_id: winlog-9000-0271
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0271-user_enumeration_and_creation_related_to_manic_menagerie_2_0_via_cmdline.yml
