title: User properties enumeration via commandline
id: winlog-0265
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to enumerate local users via commandline.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0007-Discovery/T1087-Account%20discovery
- https://blogs.jpcert.or.jp/en/2016/01/windows-commands-abused-by-attackers.html
- https://attack.mitre.org/software/S0039/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0007
- attack.t1087.001
- attack.t1087.002
- attack.discovery
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    NewProcessName|endswith:
    - \net1.exe
    - \net.exe
    CommandLine|contains:
    - net
    - user
    - domain
  filter:
    CommandLine|contains: add
  condition: selection and not filter
fields:
- Hostname
- CommandLine
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- Pentest
- Administrator activity
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-user enumeration (command).yaml
x_legacy_id: winlog-9000-0272
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0272-user_properties_enumeration_via_commandline.yml
