title: Vault credentials manager accessed
id: winlog-0267
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to access vault credentials
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1555.004-Windows%20Credential%20Manager
- https://twitter.com/SBousseaden/status/1573380065714470912
- https://sites.utexas.edu/glenmark/2019/10/21/using-passwordvault-with-powershell/
- https://twitter.com/SBousseaden/status/1573380065714470912
- https://gist.github.com/Samirbous/c3c4122493ea5076adea9c895d2340ea
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1555.004
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5382
  selection_resource:
    Resource|startswith: http
  selection_identity:
    Identity|contains: '@'
  condition: selection and (selection_resource or selection_identity)
fields:
- Hostname
- EventID
- Identity
- Resource
unique_fields:
- Hostname
falsepositives:
- software accessing the Windows Web Password Credential
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-os/win-os-vault credentials accessed (native).yaml
x_legacy_id: winlog-9000-0274
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0274-vault_credentials_manager_accessed.yml
