title: Denied RDP login with valid credentials
id: winlog-0271
status: experimental
rule_origin: public
description: Detects scenarios where an attacker tries to move laterally using RDP and access attempt is blocked due to restricted
  logon policies.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0008-Lateral%20Movement/T1021.001-Remote%20Desktop%20Protocol
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=4825
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0008
- attack.t1021.001
- attack.lateral_movement
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4825
  condition: selection
fields:
- Hostname
- EventID
unique_fields:
- Hostname
falsepositives:
- Miss configured adminitrative rights or VDI software (CITRIX, AppV, ThinApp, ...)
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-rdp/win-rdp-login denied with valid credentials.yaml
x_legacy_id: winlog-9000-0280
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0280-denied_rdp_login_with_valid_credentials.yml
