title: RDP reconnaissance with valid credentials performed on multiple hosts
id: winlog-0272
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to brutforce RDP services with compromised credentials via tools
  like Hydra. Note that this event will be reported only with valid user and password credentials, and it may be reported
  only when RDP session is fully opened (so not during reconnaisance phase) if NLA is disabled. For further correlation, ID
  4624/4625 (logon type 3, 7 or 10) should be used.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0001-Initial%20access/T1078-Valid%20accounts
- https://github.com/mehranexpert/Crazy-RDP
- https://github.com/3gstudent/SharpRDPCheck
- https://ponderthebits.com/2018/02/windows-rdp-related-event-logs-identification-tracking-and-investigation/
- https://purerds.org/remote-desktop-security/auditing-remote-desktop-services-logon-failures-1/
- http://woshub.com/rdp-connection-logs-forensics-windows/
- https://jpcertcc.github.io/ToolAnalysisResultSheet/details/mstsc.htm
- https://github.com/AndrewRathbun/DFIRMindMaps/tree/main/OSArtifacts/Windows/RDP_Authentication_Artifacts
- https://github.com/TonyPhipps/SIEM/blob/master/Notable-Event-IDs.md#microsoft-windows-remotedesktopservices-rdpcoretsoperational
- https://dfironthemountain.wordpress.com/2019/02/15/rdp-event-log-dfir/
- https://nullsec.us/windows-event-id-1029-hashes/
- https://www.13cubed.com/downloads/rdp_flowchart.pdf
- https://nullsec.us/windows-rdp-related-event-logs-the-client-side-of-the-story/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0001
- attack.t1078
- attack.t1021.001
- attack.initial_access
- attack.lateral_movement
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 1149
    Channel: Microsoft-Windows-TerminalServices-RemoteConnectionManager/Operational
  filter:
    IpAddress:
    - '%vulnerability_scanners%'
    - '%admin_jump_hosts%'
    - 127.0.0.1
    - ::1
  condition: selection and not filter
fields:
- Hostname
- Channel
- EventID
- IpAddress
unique_fields:
- IpAddress
falsepositives:
- VAS scanners, administrator jump host
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-rdp/win-rdp-reconnaissance with valid credentials performed to multiple hosts.yaml
x_legacy_id: winlog-9000-0281
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0281-rdp_reconnaissance_with_valid_credentials_performed_on_multiple_hosts.yml
