title: RDP session hijack via TSCON abuse command
id: winlog-0273
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to create a service that triggers TSCON in order to preform local
  RDP session hijack.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0008-Lateral%20Movement/T1021.001-Remote%20Desktop%20Protocol
- https://www.ired.team/offensive-security/lateral-movement/t1076-rdp-hijacking-for-lateral-movement
- https://www.csoonline.com/article/3566917/rdp-hijacking-attacks-explained-and-how-to-mitigate-them.html
- https://gist.github.com/bohops/f722f1a54d9ac1070350bdcaf2da618b
- https://doublepulsar.com/rdp-hijacking-how-to-hijack-rds-and-remoteapp-sessions-transparently-to-move-through-an-da2a1e73a5f6
- https://twitter.com/bohops/status/992232940900962304
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0008
- attack.t1563.002
- attack.lateral_movement
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    EventID: 4688
    CommandLine|contains|all:
    - tscon
    - dest:rdp-
  condition: selection
fields:
- Hostname
- CommandLine
- EventID
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-rdp/win-rdp-session hijack (TSCON) (command).yaml
x_legacy_id: winlog-9000-0282
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0282-rdp_session_hijack_via_tscon_abuse_command.yml
