title: RDP session hijack via service creation abuse
id: winlog-0274
status: experimental
rule_origin: public
description: Detects scenarios where an attacker create a service that triggers TSCON in order to preform local RDP session
  hijack.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1543.003-Create%20or%20Modify%20System%20Process-Windows%20Service
- https://www.ired.team/offensive-security/lateral-movement/t1076-rdp-hijacking-for-lateral-movement
- https://www.csoonline.com/article/3566917/rdp-hijacking-attacks-explained-and-how-to-mitigate-them.html
- https://gist.github.com/bohops/f722f1a54d9ac1070350bdcaf2da618b
- https://doublepulsar.com/rdp-hijacking-how-to-hijack-rds-and-remoteapp-sessions-transparently-to-move-through-an-da2a1e73a5f6
- https://twitter.com/bohops/status/992232940900962304
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1543.003
- attack.t1563.002
- attack.persistence
- attack.lateral_movement
logsource:
  product: windows
  service:
  - system
  - security
detection:
  selection1:
    EventID: 4697
    ServiceFileName|contains|all:
    - 'tscon '
    - /dest:rdp-
  selection2:
    EventID: 7045
    ImagePath|contains|all:
    - 'tscon '
    - /dest:rdp-
  condition: 1 of selection*
fields:
- Hostname
- EventID
- ImagePath
- ServiceFileName
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-rdp/win-rdp-session hijack (TSCON) (service).yaml
x_legacy_id: winlog-9000-0283
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0283-rdp_session_hijack_via_service_creation_abuse.yml
