title: Scheduled task creation with command line
id: winlog-0279
status: experimental
rule_origin: public
description: Detects scenarios where an attacker creates a scheduled task via commmand line.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0002-Execution/T1053.005-Scheduled%20Task
- https://www.ired.team/offensive-security/persistence/t1053-schtask
- https://pentestlab.blog/2019/11/04/persistence-scheduled-tasks/
- http://www.fuzzysecurity.com/tutorials/19.html
- https://nasbench.medium.com/a-deep-dive-into-windows-scheduled-tasks-and-the-processes-running-them-218d1eed4cce
- https://posts.specterops.io/abstracting-scheduled-tasks-3b6451f6a1c5
- https://www.darkoperator.com/blog/2009/4/11/abusing-the-scheduler-with-meterpreter.html
- https://blog.menasec.net/2019/03/threat-hunting-25-scheduled-tasks-for.html
- https://strontic.github.io/xcyclopedia/library/schtasks.exe-5BD86A7193D38880F339D4AFB1F9B63A.html
- https://nasbench.medium.com/behind-the-detection-schtasks-eb67a33a8710
- https://redcanary.com/threat-detection-report/techniques/scheduled-task/
- https://www.linkedin.com/pulse/lolbin-attacks-scheduled-tasks-t1503005-how-detect-them-v%C3%B6gele
- https://www.elastic.co/security-labs/invisible-miners-unveiling-ghostengine
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0002
- attack.t1053.005
- attack.execution
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    NewProcessName|endswith: \schtasks.exe
    CommandLine|contains: create
  filter:
    CommandLine|contains|all:
    - tr
    - sc
  condition: selection and not filter
fields:
- Hostname
- CommandLine
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- Administrator
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-scheduled_task/win-os-scheduled task creation (command).yaml
x_legacy_id: winlog-9000-0292
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0292-scheduled_task_creation_with_command_line.yml
