title: Interactive privileged shell triggered by schedule task (deprecated)
id: winlog-0283
status: experimental
rule_origin: public
description: Detects scenarios where an attacker abuse the at command to elevate privilages. Note that at command is deprecated
  since Windows 8 and replaced by schtask.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0002-Execution/T1053.005-Scheduled%20Task
- https://docs.microsoft.com/en-us/troubleshoot/windows-client/system-management-components/use-at-command-to-schedule-tasks
- https://strontic.github.io/xcyclopedia/library/at.exe-5FD22B915C232378E567160D641CC9F2.html
- https://blog.menasec.net/2019/03/threat-hunting-25-scheduled-tasks-for.html
- https://blogs.jpcert.or.jp/en/2016/01/windows-commands-abused-by-attackers.html
- https://www.linkedin.com/pulse/lolbin-attacks-scheduled-tasks-t1503005-how-detect-them-v%C3%B6gele
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0002
- attack.t1053.005
- attack.execution
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith: \cmd.exe
    CommandLine|contains|all:
    - at
    - interactive
    - cmd
  condition: selection
fields:
- Hostname
- CommandLine
- EventID
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-scheduled_task/win-os-scheduled task triggers interactive shell (at, deprecated).yaml
x_legacy_id: winlog-9000-0296
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0296-interactive_privileged_shell_triggered_by_schedule_task_deprecated.yml
