title: EAP service activation by Liontail framework for DLL sideloading (via command)
id: winlog-0284
status: stable
rule_origin: public
description: Detects scenarios where an attacker enable the Eaphost component in order to perform a DLL sideloading attack.
references:
- https://research.checkpoint.com/2023/from-albania-to-the-middle-east-the-scarred-manticore-is-listening/
- https://securelist.com/incident-response-interesting-cases-2023/113611/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0004
- attack.t1543.003
- attack.privilege_escalation
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \sc.exe
    CommandLine|contains|all:
    - config
    - Eaphost
    - start
  condition: selection
fields:
- Hostname
- CommandLine
- Image
unique_fields:
- Hostname
falsepositives:
- Administrator activity
- VPN/IPsec server activation
- RAS/RADIUS server activation
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-services/win-os-VPN-EAP service activation by Liontail framework for DLL sideloading (command).yaml
x_legacy_id: winlog-9000-0297
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0297-eap_service_activation_by_liontail_framework_for_dll_sideloading_via_com.yml
