title: Service abuse with malicious ImagePath (Reg via PowerShell)
id: winlog-0290
status: experimental
rule_origin: public
description: Detects scenarios where an attacker modify the original service executable path with a malicious one.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1543.003-Create%20or%20Modify%20System%20Process-Windows%20Service
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc742019(v=ws.11)
- https://pentestlab.blog/2020/01/22/persistence-modify-existing-service/
- https://medium.com/r3d-buck3t/abuse-service-registry-acls-windows-privesc-f88079140509
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1543.003
- attack.persistence
logsource:
  product: windows
  category:
  - ps_module
  - ps_script
detection:
  selection_powershell_modern:
    EventID: 4103
    Payload|contains|all:
    - -ItemProperty
    - \SYSTEM\CurrentControlSet\Services\
    - ImagePath
  selection_powershell_block:
    EventID: 4104
    ScriptBlockText|contains|all:
    - -ItemProperty
    - \SYSTEM\CurrentControlSet\Services\
    - ImagePath
  condition: 1 of selection*
fields:
- Hostname
- EventID
- Payload
- ScriptBlockText
unique_fields:
- Hostname
falsepositives:
- administrator reconfiguring service
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-services/win-os-service abuse with malicious ImagePath (Reg via PowerShell).yaml
x_legacy_id: winlog-9000-0303
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0303-service_abuse_with_malicious_imagepath_reg_via_powershell.yml
