title: Service abuse with malicious ImagePath (service)
id: winlog-0292
status: experimental
rule_origin: public
description: Detects scenarios where an attacker modify the original service executable path with a malicious one.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1543.003-Create%20or%20Modify%20System%20Process-Windows%20Service
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc742019(v=ws.11)
- https://pentestlab.blog/2020/01/22/persistence-modify-existing-service/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1543.003
- attack.persistence
logsource:
  product: windows
  category: process_creation
detection:
  selection_process:
    NewProcessName|endswith: \sc.exe
    CommandLine|contains|all:
    - sc
    - config
    - binpath
  condition: selection_process
fields:
- Hostname
- CommandLine
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- administrator reconfiguring service
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-services/win-os-service abuse with malicious ImagePath (service).yaml
x_legacy_id: winlog-9000-0305
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0305-service_abuse_with_malicious_imagepath_service.yml
