title: Impacket SMBexec service registration (native)
id: winlog-0295
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to register the SMBexec service to estasblish persistence. Note
  that service registration is not always performed and that is recommended to use the related registry SYSMON rule to increase
  detection reliability.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1543.003-Create%20or%20Modify%20System%20Process-Windows%20Service
- https://github.com/SecureAuthCorp/impacket/blob/master/examples/smbexec.py
- https://nv2lt.github.io/windows/smb-psexec-smbexec-winexe-how-to/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0005
- attack.t1112
- attack.t1543.003
- attack.defense_evasion
- attack.privilege_execution
logsource:
  product: windows
  service:
  - system
  - security
detection:
  selection:
    EventID:
    - 4697
    - 7045
    ServiceName: BTOBTO
  filter: ''
  condition: selection
fields:
- Hostname
- EventID
- ServiceName
- filter
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-services/win-os-service creation SMBexec (native).yaml
x_legacy_id: winlog-9000-0308
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0308-impacket_smbexec_service_registration_native.yml
