title: Service deactivation (command)
id: winlog-0296
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to disable
references:
- https://www.sentinelone.com/labs/black-basta-ransomware-attacks-deploy-custom-edr-evasion-tools-tied-to-fin7-threat-actor/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0040
- attack.t1489
- attack.impact
- attack.defense_evasion
- attack.1562.001
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    NewProcessName|endswith: \sc.exe
    CommandLine|contains|all:
    - sc
    - config
    - disabled
  condition: selection
fields:
- Hostname
- CommandLine
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- troubleshooting
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-services/win-os-service deactivation (command).yaml
x_legacy_id: winlog-9000-0310
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0310-service_deactivation_command.yml
