title: Service permissions hijacked for privileges abuse (reg via command)
id: winlog-0303
status: experimental
rule_origin: public
description: Detects scenarios where an attacker modify the permissions of a service in order to abuse its privileges
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1543.003-Create%20or%20Modify%20System%20Process-Windows%20Service
- http://woshub.com/set-permissions-on-windows-service/
- https://www.winhelponline.com/blog/view-edit-service-permissions-windows/
- https://decoder.cloud/2019/02/07/demystifying-windows-service-permissions-configuration/
- https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.management/set-service?view=powershell-7.1
- https://medium.com/r3d-buck3t/abuse-service-registry-acls-windows-privesc-f88079140509
- https://github.com/rohnedwards/PowerShellAccessControl
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1543.003
- attack.t1574.010
- attack.persistence
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith: \reg.exe
    CommandLine|contains: REG ADD
    CommandLine|re: \\SYSTEM\\CurrentControlSet\\Services\\.*\\Security
  condition: selection
fields:
- Hostname
- CommandLine
- EventID
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- administrator reconfiguring service
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-services/win-os-service permissions modified (Reg via command).yaml
x_legacy_id: winlog-9000-0317
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0317-service_permissions_hijacked_for_privileges_abuse_reg_via_command.yml
