title: Massive services termination burst
id: winlog-0307
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to stop multiples services on a host. Attacker may target services
  related to databases, security products or backups (Veeam, Symantec, Acronis ...).
references:
- https://www.microsoft.com/security/blog/2020/03/05/human-operated-ransomware-attacks-a-preventable-disaster/
- https://fourcore.io/blogs/ryuk-ransomware-simulation-mitre-ttp
- https://thedfirreport.com/2021/12/13/diavol-ransomware/
- https://www.sentinelone.com/labs/black-basta-ransomware-attacks-deploy-custom-edr-evasion-tools-tied-to-fin7-threat-actor/
- https://www.trendmicro.com/en_us/research/22/h/ransomware-actor-abuses-genshin-impact-anti-cheat-driver-to-kill-antivirus.html
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0040
- attack.t1489
- attack.impact
- attack.defense_evasion
- attack.1562.001
logsource:
  product: windows
  category: process_creation
detection:
  selection_net_stop:
    NewProcessName|endswith:
    - \net1.exe
    - \net.exe
    CommandLine|contains|all:
    - net
    - stop
  selection_sc_stop:
    NewProcessName|endswith: \sc.exe
    CommandLine|contains|all:
    - sc
    - stop
  condition: selection_net_stop or selection_sc_stop
  timeframe: 1m
fields:
- Hostname
- CommandLine
- NewProcessName
- EventRecordID
unique_fields:
- Hostname
falsepositives:
- Administrator debugging
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-services/win-os-service termination burst.yaml
x_legacy_id: winlog-9000-0321
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0321-massive_services_termination_burst.yml
