title: Metasploit reverse shell injection in SQL Server
id: winlog-0308
status: experimental
rule_origin: public
description: Detects scenarios where an attacker inject a payload into SQL Server in order to obtain a remote shell.
references:
- https://www.offensive-security.com/metasploit-unleashed/payloads-mssql/#
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0002
- attack.t1059.003
- attack.execution
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    ParentProcessName|endswith: \sqlservr.exe
    NewProcessName|endswith:
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
    CommandLine|contains|all:
    - cmd
    - echo
    CommandLine|contains:
    - /c
    - -c
  condition: selection
fields:
- Hostname
- CommandLine
- NewProcessName
- ParentProcessName
unique_fields:
- Hostname
falsepositives:
- none
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-sql_server/sql_server-MSF reverse shell exploit.yaml
x_legacy_id: winlog-9000-0322
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0322-metasploit_reverse_shell_injection_in_sql_server.yml
