title: SQL Server Dedicated Admin Connection (DAC) mode activated (native)
id: winlog-0309
status: experimental
rule_origin: public
description: Detects scenarios where an attacker enabled the DAC mode in order to bypass access controls, logon triggers,
  perform brute force attacks or run unauthorized queries.
references:
- https://josephpierini.blogspot.com/2012/07/microsoft-sql-dedicated-admin.html
- https://www.sqlshack.com/sql-server-dedicated-admin-connection-dac-how-to-enable-connect-and-use/
- https://www.mssqltips.com/sqlservertip/1801/enable-sql-server-dedicated-administrator-connection/
- https://docs.microsoft.com/en-us/sql/relational-databases/errors-events/database-engine-events-and-errors?view=sql-server-ver16
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1505.001
- attack.persistence
logsource:
  product: mssql
  service: application
detection:
  selection:
    EventID: 15457
    EventData|contains: <Data>remote admin connections</Data><Data>0</Data><Data>1</Data>
  condition: selection
fields:
- Hostname
- EventData
- EventID
unique_fields:
- Hostname
falsepositives:
- Admin attempting to debug or recover a SQL Server
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-sql_server/sql_server-SQL Server DAC mode activated.yaml
x_legacy_id: winlog-9000-0323
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0323-sql_server_dedicated_admin_connection_dac_mode_activated_native.yml
