title: SQL Server started in single mode (command)
id: winlog-0311
status: experimental
rule_origin: public
description: Detects scenarios where an attacker starts SQL Server service in single mode to perform password recovery actions
  using, for example, the native sqlcmd tool. Indeed, when the SQL Server is started in single user mode, all the users who
  are a member of the host’s local administrator group can connect to the SQL instance.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1505.001-SQL%20Stored%20Procedures
- https://www.sqlshack.com/different-ways-to-start-a-sql-server-single-user-mode/
- https://www.sqlshack.com/recover-lost-sa-password/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1505.001
- attack.persistence
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith:
    - \net1.exe
    - \net.exe
    CommandLine|contains|all:
    - start
    - MSSQL$
    CommandLine|contains:
    - /m
    - -m
  condition: selection
fields:
- Hostname
- CommandLine
- EventID
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- Master database restore procedure
- Maintenance operation
- Legitim SA account password recovery
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-sql_server/sql_server-SQL Server started in single mode (command).yaml
x_legacy_id: winlog-9000-0325
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0325-sql_server_started_in_single_mode_command.yml
