title: SQL Server - Brutforce enumeration with non existing users (login)
id: winlog-0313
status: experimental
rule_origin: public
description: Detects scenarios where an attacker attempts to enumerate potential existing SQL users, resulting in failed logins
  with unexisting or invalid accounts.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1110.xxx-Brut%20force
- https://www.eraofdata.com/sql-server/connectivity/login-failures/
- https://docs.microsoft.com/en-us/previous-versions/sql/sql-server-2008-r2/ms366351(v=sql.105)
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0006
- attack.t1110
- attack.credential_access
logsource:
  product: mssql
  category: application
detection:
  selection:
    EventID: 33205
    action_id:
    - LGFL
    - LGIF
    class_type: LX
    additional_information|contains:
    - <state>2</state>
    - <state>5</state>
  condition: selection
  timeframe: 30m
fields:
- Hostname
- EventID
- action_id
- additional_information
- class_type
- server_principal_name
unique_fields:
- Hostname
falsepositives:
- Missconfigured application
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-sql_server/sql_server-brutforce enumeration with unexisting users.yaml
x_legacy_id: winlog-9000-0327
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0327-sql_server_brutforce_enumeration_with_non_existing_users_login.yml
