title: SQL Server database auditing deactivated
id: winlog-0314
status: experimental
rule_origin: public
description: Detects scenarios where an attacker deactivates SQL Server database auditing capacities. SQL auditing requires
  previous configuration on each SQL instance.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1562.002-Disable%20Windows%20Event%20Logging
- https://www.ultimatewindowssecurity.com/sqlserver/auditlog/sampleevent.aspx
- https://docs.microsoft.com/en-us/sql/relational-databases/security/auditing/sql-server-audit-action-groups-and-actions?view=sql-server-2017
- https://www.sqlshack.com/various-techniques-to-audit-sql-server-databases/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0005
- attack.t1562.002
- attack.defense_evasion
logsource:
  product: mssql
  category: application
detection:
  sql_server_event:
    EventID: 33205
  database_audit_spec_disable:
    action_id: AL
    class_type: DA
    statement|contains: STATE = OFF
  database_audit_spec_delete:
    action_id: DR
    class_type: DA
  condition: sql_server_event and (database_audit_spec_disable or database_audit_spec_delete)
fields:
- Hostname
- EventID
- action_id
- class_type
- statement
unique_fields:
- Hostname
falsepositives:
- DBA policy change
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-sql_server/sql_server-database auditing capacities deactivated.yaml
x_legacy_id: winlog-9000-0328
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0328-sql_server_database_auditing_deactivated.yml
