title: SQL server sqlcmd utility abuse for privilege escalation
id: winlog-0322
status: experimental
rule_origin: public
description: Detects scenarios where an attacker uses sqlcmd utility to escalate privileges or introduce weaknesses.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1505.001-SQL%20Stored%20Procedures
- https://blog.netspi.com/when-databases-attack-hacking-with-the-osql-utility/
- http://travisaltman.com/pen-test-and-hack-microsoft-sql-server-mssql/
- https://thedfirreport.com/2021/12/13/diavol-ransomware/
- https://twitter.com/TheDFIRReport/status/1498804631090208777?t=TKMbiJINaLoJqQqXIF5mCA&s=09
- https://blog.talosintelligence.com/breaking-the-silence-recent-truebot-activity/
- https://unit42.paloaltonetworks.com/espionage-campaign-targets-south-asian-entities/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1505.001
- attack.persistence
- None
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    NewProcessName|endswith:
    - \sqlcmd.exe
    - \osql.exe
    CommandLine|contains:
    - /Q
    - -Q
  condition: selection
fields:
- Hostname
- CommandLine
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- Master database restore procedure
- Maintenance operation
- Legitim SA account password recovery
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-sql_server/sql_server-sqlcmd and osql tools abuse.yaml
x_legacy_id: winlog-9000-0336
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0336-sql_server_sqlcmd_utility_abuse_for_privilege_escalation.yml
