title: SQL Server xp_cmdshell activation (native event)
id: winlog-0324
status: experimental
rule_origin: public
description: Detects scenarios where an attacker enable the xp_cmdshell in order to execute non SQL content and escalate privileges
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1505.001-SQL%20Stored%20Procedures
- https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
- https://asec.ahnlab.com/en/52479/
- https://www.microsoft.com/en-us/security/blog/2023/10/03/defending-new-vectors-threat-actors-attempt-sql-server-to-cloud-lateral-movement/
- https://github.com/Azure/Azure-Sentinel/blob/master/Solutions/Azure%20SQL%20Database%20solution%20for%20sentinel/Hunting%20Queries/HuntingQuery-SuspiciousStoredProcedures.yaml
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0003
- attack.t1505
- attack.persistence
- attack.T1505
logsource:
  product: mssql
  category: application
detection:
  selection_baseline:
    EventID: 15457
  selection_raw:
    EventData|contains: <Data>xp_cmdshell</Data><Data>0</Data><Data>1</Data>
  selection_enriched:
    Message|contains: option 'xp_cmdshell' changed from 0 to 1
  condition: selection_baseline and (selection_raw or selection_enriched)
fields:
- Hostname
- EventData
- EventID
- Message
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-sql_server/sql_server-xp_cmdshell activated.yaml
x_legacy_id: winlog-9000-0338
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0338-sql_server_xp_cmdshell_activation_native_event.yml
