title: WinRS usage for remote execution
id: winlog-0326
status: experimental
rule_origin: public
description: Detects scenarios where an attacker abuses the WinRS capacities for remote execution.
references:
- https://www.ired.team/offensive-security/lateral-movement/winrs-for-lateral-movement
- https://bohops.com/2020/05/12/ws-management-com-another-approach-for-winrm-lateral-movement/
- https://4sysops.com/archives/powershell-remoting-without-administrator-rights/
- https://www.synacktiv.com/publications/traces-of-windows-remote-command-execution.html
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0008
- attack.t1021.006
- attack.lateral_movement
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    NewProcessName|endswith: \winrs.exe
    CommandLine|contains:
    - '-r:'
    - '/r:'
  condition: selection
fields:
- Hostname
- CommandLine
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- Pentest, Administrator activity
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-winrm/win-winrm-winrs usage for remote execution.yaml
x_legacy_id: winlog-9000-0341
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0341-winrs_usage_for_remote_execution.yml
