title: Windows Subsystem for Linux (WSL) installation (command)
id: winlog-0328
status: experimental
rule_origin: public
description: Detects scenarios where an attacker enables the WSL to cary out malicious activities in a virtual instance to
  avoid detection.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1564-Hide%20artifacts
- https://learn.microsoft.com/en-us/windows/wsl/install-manual
- https://learn.microsoft.com/en-us/windows/wsl/install
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Wsl/
- https://blog.f-secure.com/hunting-for-windows-subsystem-for-linux/
- https://blog.lumen.com/no-longer-just-theory-black-lotus-labs-uncovers-linux-executables-deployed-as-stealth-windows-loaders/
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/04
tags:
- TA0005
- attack.t1564.006
- attack.defense_evasion
logsource:
  product: windows
  category: process_creation
detection:
  selection_wsl_activation_modern:
    CommandLine|contains|all:
    - wsl
    - --install
  selection_wsl_activation_deprecated:
    NewProcessName|endswith: \dism.exe
    CommandLine|contains|all:
    - Enable-feature
    - Microsoft-Windows-Subsystem-Linux
  condition: selection_wsl_activation_modern or selection_wsl_activation_deprecated
fields:
- Hostname
- CommandLine
- NewProcessName
unique_fields:
- Hostname
falsepositives:
- developer computer (with Visual Studio Code)
- administrator activity
level: medium
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-wsl/win-os-Linux Subsystem (WSL) installation (command).yaml
x_legacy_id: winlog-9000-0343
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0343-windows_subsystem_for_linux_wsl_installation_command.yml
