title: NetSYnc attack share source
id: winlog-0329
status: experimental
rule_origin: public
description: Source event for the NetSYnc multi-event flow rule.
references:
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/05
tags:
- TA0006
- attack.t1003.006
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection_share:
    EventID: 5145
    Hostname: '%domain_controllers%'
    ShareName: \\*\IPC$
    RelativeTargetName: NETLOGON
  condition: selection_share
fields:
- Hostname
- EventID
- ShareName
- RelativeTargetName
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-netsync attack.yaml
x_source_component: selection_share
x_legacy_id: winlog-9000-0345
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0345-netsync_attack_share_source.yml
