title: User password change without previous password known - SetNTLM login source
id: winlog-0331
status: experimental
rule_origin: public
description: Source NTLM login event for the SetNTLM multi-event flow rule.
references:
- https://github.com/mdecrevoisier/SIGMA-detection-rules
author: mdecrevoisier
date: 2026/05/04
modified: 2026/05/05
tags:
- TA0006
- attack.t1003
- attack.credential_access
logsource:
  product: windows
  service: security
detection:
  selection_login:
    EventID: 4624
    AuthenticationPackageName: NTLM
  filter:
    IpAddress:
    - 127.0.0.1
    - ::1
  condition: selection_login and not filter
fields:
- Hostname
- EventID
- AuthenticationPackageName
- IpAddress
unique_fields:
- Hostname
falsepositives:
- None
level: high
x_source_repository: https://github.com/mdecrevoisier/SIGMA-detection-rules
x_source_commit: ab15e29fcdbed297e305e2602881b8654946592c
x_source_file: windows-active_directory/win-ad-user password change with setNTLM (Mimikatz).yaml
x_source_component: selection_login
x_legacy_id: winlog-9000-0347
x_legacy_file: engine/rules/winlog/sigma_ref/9000-0347-setntlm_mimikatz_login_source.yml
